/* automatically generated by rust-bindgen 0.71.1 */
#![allow(improper_ctypes)]
#![allow(non_upper_case_globals)]
#![allow(non_camel_case_types)]
#![allow(unsafe_op_in_unsafe_fn)]
#![allow(clippy::missing_safety_doc)]
#![allow(clippy::ptr_offset_with_cast)]
#![allow(clippy::useless_transmute)]

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;

unsafe extern "C" {
    pub fn Sregister_boot_relative_file(arg1: *const ::core::ffi::c_char);
}
unsafe extern "C" {
    pub fn Sregister_boot_file_fd(arg1: *const ::core::ffi::c_char, arg2: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn Sregister_boot_file_fd_region(
        arg1: *const ::core::ffi::c_char,
        arg2: ::core::ffi::c_int,
        arg3: iptr,
        arg4: iptr,
        arg5: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn Sregister_boot_file_bytes(
        arg1: *const ::core::ffi::c_char,
        arg2: *mut ::core::ffi::c_void,
        arg3: iptr,
    );
}
unsafe extern "C" {
    pub fn Sregister_heap_file(arg1: *const ::core::ffi::c_char);
}
unsafe extern "C" {
    pub fn Scompact_heap();
}
unsafe extern "C" {
    pub fn Ssave_heap(arg1: *const ::core::ffi::c_char, arg2: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn Sbuild_heap(
        arg1: *const ::core::ffi::c_char,
        arg2: ::core::option::Option<unsafe extern "C" fn()>,
    );
}
unsafe extern "C" {
    pub fn Senable_expeditor(arg1: *const ::core::ffi::c_char);
}
unsafe extern "C" {
    pub fn Sscheme_start(
        arg1: ::core::ffi::c_int,
        arg2: *mut *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn Sscheme_script(
        arg1: *const ::core::ffi::c_char,
        arg2: ::core::ffi::c_int,
        arg3: *mut *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn Sscheme_program(
        arg1: *const ::core::ffi::c_char,
        arg2: ::core::ffi::c_int,
        arg3: *mut *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn Sscheme_deinit();
}
unsafe extern "C" {
    pub fn Sscheme_register_signal_registerer(
        f: ::core::option::Option<unsafe extern "C" fn(arg1: ::core::ffi::c_int)>,
    );
}
unsafe extern "C" {
    pub fn Sactivate_thread() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn Sdeactivate_thread();
}
unsafe extern "C" {
    pub fn Sdestroy_thread() -> ::core::ffi::c_int;
}
pub type I8 = ::core::ffi::c_char;
pub type U8 = ::core::ffi::c_uchar;
pub type I16 = ::core::ffi::c_short;
pub type U16 = ::core::ffi::c_ushort;
pub type I32 = ::core::ffi::c_int;
pub type U32 = ::core::ffi::c_uint;
pub type I64 = ::core::ffi::c_long;
pub type U64 = ::core::ffi::c_ulong;
unsafe extern "C" {
    pub fn RS_free_str(arg1: *mut ::core::ffi::c_void);
}
pub type memcpy_t = *mut ::core::ffi::c_char;
pub type tputsputcchar = ::core::ffi::c_int;
pub type off_t = ::core::ffi::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    _unused: [u8; 0],
}
pub type FILE = _IO_FILE;
pub type va_list = __builtin_va_list;
pub type __isoc_va_list = __builtin_va_list;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _G_fpos64_t {
    pub __opaque: [::core::ffi::c_char; 16usize],
    pub __lldata: ::core::ffi::c_longlong,
    pub __align: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _G_fpos64_t"][::core::mem::size_of::<_G_fpos64_t>() - 16usize];
    ["Alignment of _G_fpos64_t"][::core::mem::align_of::<_G_fpos64_t>() - 8usize];
    ["Offset of field: _G_fpos64_t::__opaque"]
        [::core::mem::offset_of!(_G_fpos64_t, __opaque) - 0usize];
    ["Offset of field: _G_fpos64_t::__lldata"]
        [::core::mem::offset_of!(_G_fpos64_t, __lldata) - 0usize];
    ["Offset of field: _G_fpos64_t::__align"]
        [::core::mem::offset_of!(_G_fpos64_t, __align) - 0usize];
};
pub type fpos_t = _G_fpos64_t;
unsafe extern "C" {
    pub static stdin: *mut FILE;
}
unsafe extern "C" {
    pub static stdout: *mut FILE;
}
unsafe extern "C" {
    pub static stderr: *mut FILE;
}
unsafe extern "C" {
    pub fn fopen(arg1: *const ::core::ffi::c_char, arg2: *const ::core::ffi::c_char) -> *mut FILE;
}
unsafe extern "C" {
    pub fn freopen(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: *mut FILE,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fclose(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn remove(arg1: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn rename(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn feof(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ferror(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fflush(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn clearerr(arg1: *mut FILE);
}
unsafe extern "C" {
    pub fn fseek(
        arg1: *mut FILE,
        arg2: ::core::ffi::c_long,
        arg3: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ftell(arg1: *mut FILE) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn rewind(arg1: *mut FILE);
}
unsafe extern "C" {
    pub fn fgetpos(arg1: *mut FILE, arg2: *mut fpos_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fsetpos(arg1: *mut FILE, arg2: *const fpos_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fread(
        arg1: *mut ::core::ffi::c_void,
        arg2: ::core::ffi::c_ulong,
        arg3: ::core::ffi::c_ulong,
        arg4: *mut FILE,
    ) -> ::core::ffi::c_ulong;
}
unsafe extern "C" {
    pub fn fwrite(
        arg1: *const ::core::ffi::c_void,
        arg2: ::core::ffi::c_ulong,
        arg3: ::core::ffi::c_ulong,
        arg4: *mut FILE,
    ) -> ::core::ffi::c_ulong;
}
unsafe extern "C" {
    pub fn fgetc(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn getc(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn getchar() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ungetc(arg1: ::core::ffi::c_int, arg2: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fputc(arg1: ::core::ffi::c_int, arg2: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn putc(arg1: ::core::ffi::c_int, arg2: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn putchar(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fgets(
        arg1: *mut ::core::ffi::c_char,
        arg2: ::core::ffi::c_int,
        arg3: *mut FILE,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn fputs(arg1: *const ::core::ffi::c_char, arg2: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn puts(arg1: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn printf(arg1: *const ::core::ffi::c_char, ...) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fprintf(arg1: *mut FILE, arg2: *const ::core::ffi::c_char, ...) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sprintf(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn snprintf(
        arg1: *mut ::core::ffi::c_char,
        arg2: ::core::ffi::c_ulong,
        arg3: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn vprintf(
        arg1: *const ::core::ffi::c_char,
        arg2: *mut __va_list_tag,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn vfprintf(
        arg1: *mut FILE,
        arg2: *const ::core::ffi::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn vsprintf(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn vsnprintf(
        arg1: *mut ::core::ffi::c_char,
        arg2: ::core::ffi::c_ulong,
        arg3: *const ::core::ffi::c_char,
        arg4: *mut __va_list_tag,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn scanf(arg1: *const ::core::ffi::c_char, ...) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fscanf(arg1: *mut FILE, arg2: *const ::core::ffi::c_char, ...) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sscanf(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn vscanf(arg1: *const ::core::ffi::c_char, arg2: *mut __va_list_tag)
        -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn vfscanf(
        arg1: *mut FILE,
        arg2: *const ::core::ffi::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn vsscanf(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn perror(arg1: *const ::core::ffi::c_char);
}
unsafe extern "C" {
    pub fn setvbuf(
        arg1: *mut FILE,
        arg2: *mut ::core::ffi::c_char,
        arg3: ::core::ffi::c_int,
        arg4: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn setbuf(arg1: *mut FILE, arg2: *mut ::core::ffi::c_char);
}
unsafe extern "C" {
    pub fn tmpnam(arg1: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
unsafe extern "C" {
    pub fn fmemopen(
        arg1: *mut ::core::ffi::c_void,
        arg2: usize,
        arg3: *const ::core::ffi::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn open_memstream(arg1: *mut *mut ::core::ffi::c_char, arg2: *mut usize) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fdopen(arg1: ::core::ffi::c_int, arg2: *const ::core::ffi::c_char) -> *mut FILE;
}
unsafe extern "C" {
    pub fn popen(arg1: *const ::core::ffi::c_char, arg2: *const ::core::ffi::c_char) -> *mut FILE;
}
unsafe extern "C" {
    pub fn pclose(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fileno(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fseeko(arg1: *mut FILE, arg2: off_t, arg3: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ftello(arg1: *mut FILE) -> off_t;
}
unsafe extern "C" {
    pub fn dprintf(
        arg1: ::core::ffi::c_int,
        arg2: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn vdprintf(
        arg1: ::core::ffi::c_int,
        arg2: *const ::core::ffi::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn flockfile(arg1: *mut FILE);
}
unsafe extern "C" {
    pub fn ftrylockfile(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn funlockfile(arg1: *mut FILE);
}
unsafe extern "C" {
    pub fn getc_unlocked(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn getchar_unlocked() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn putc_unlocked(arg1: ::core::ffi::c_int, arg2: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn putchar_unlocked(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn getdelim(
        arg1: *mut *mut ::core::ffi::c_char,
        arg2: *mut usize,
        arg3: ::core::ffi::c_int,
        arg4: *mut FILE,
    ) -> isize;
}
unsafe extern "C" {
    pub fn getline(arg1: *mut *mut ::core::ffi::c_char, arg2: *mut usize, arg3: *mut FILE)
        -> isize;
}
unsafe extern "C" {
    pub fn renameat(
        arg1: ::core::ffi::c_int,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_int,
        arg4: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ctermid(arg1: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn tempnam(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn cuserid(arg1: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn setlinebuf(arg1: *mut FILE);
}
unsafe extern "C" {
    pub fn setbuffer(arg1: *mut FILE, arg2: *mut ::core::ffi::c_char, arg3: usize);
}
unsafe extern "C" {
    pub fn fgetc_unlocked(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fputc_unlocked(arg1: ::core::ffi::c_int, arg2: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fflush_unlocked(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fread_unlocked(
        arg1: *mut ::core::ffi::c_void,
        arg2: usize,
        arg3: usize,
        arg4: *mut FILE,
    ) -> usize;
}
unsafe extern "C" {
    pub fn fwrite_unlocked(
        arg1: *const ::core::ffi::c_void,
        arg2: usize,
        arg3: usize,
        arg4: *mut FILE,
    ) -> usize;
}
unsafe extern "C" {
    pub fn clearerr_unlocked(arg1: *mut FILE);
}
unsafe extern "C" {
    pub fn feof_unlocked(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ferror_unlocked(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fileno_unlocked(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn getw(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn putw(arg1: ::core::ffi::c_int, arg2: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fgetln(arg1: *mut FILE, arg2: *mut usize) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn asprintf(
        arg1: *mut *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn vasprintf(
        arg1: *mut *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::core::ffi::c_int;
}
pub type wchar_t = ::core::ffi::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __ll: ::core::ffi::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __ld: u128,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of max_align_t"][::core::mem::size_of::<max_align_t>() - 32usize];
    ["Alignment of max_align_t"][::core::mem::align_of::<max_align_t>() - 16usize];
    ["Offset of field: max_align_t::__ll"][::core::mem::offset_of!(max_align_t, __ll) - 0usize];
    ["Offset of field: max_align_t::__ld"][::core::mem::offset_of!(max_align_t, __ld) - 16usize];
};
pub type time_t = ::core::ffi::c_long;
pub type clockid_t = ::core::ffi::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: time_t,
    pub tv_nsec: ::core::ffi::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timespec"][::core::mem::size_of::<timespec>() - 16usize];
    ["Alignment of timespec"][::core::mem::align_of::<timespec>() - 8usize];
    ["Offset of field: timespec::tv_sec"][::core::mem::offset_of!(timespec, tv_sec) - 0usize];
    ["Offset of field: timespec::tv_nsec"][::core::mem::offset_of!(timespec, tv_nsec) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread {
    _unused: [u8; 0],
}
pub type pthread_t = *mut __pthread;
pub type pthread_once_t = ::core::ffi::c_int;
pub type pthread_key_t = ::core::ffi::c_uint;
pub type pthread_spinlock_t = ::core::ffi::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_mutexattr_t {
    pub __attr: ::core::ffi::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutexattr_t"][::core::mem::size_of::<pthread_mutexattr_t>() - 4usize];
    ["Alignment of pthread_mutexattr_t"][::core::mem::align_of::<pthread_mutexattr_t>() - 4usize];
    ["Offset of field: pthread_mutexattr_t::__attr"]
        [::core::mem::offset_of!(pthread_mutexattr_t, __attr) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_condattr_t {
    pub __attr: ::core::ffi::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_condattr_t"][::core::mem::size_of::<pthread_condattr_t>() - 4usize];
    ["Alignment of pthread_condattr_t"][::core::mem::align_of::<pthread_condattr_t>() - 4usize];
    ["Offset of field: pthread_condattr_t::__attr"]
        [::core::mem::offset_of!(pthread_condattr_t, __attr) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_barrierattr_t {
    pub __attr: ::core::ffi::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrierattr_t"][::core::mem::size_of::<pthread_barrierattr_t>() - 4usize];
    ["Alignment of pthread_barrierattr_t"]
        [::core::mem::align_of::<pthread_barrierattr_t>() - 4usize];
    ["Offset of field: pthread_barrierattr_t::__attr"]
        [::core::mem::offset_of!(pthread_barrierattr_t, __attr) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_rwlockattr_t {
    pub __attr: [::core::ffi::c_uint; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlockattr_t"][::core::mem::size_of::<pthread_rwlockattr_t>() - 8usize];
    ["Alignment of pthread_rwlockattr_t"][::core::mem::align_of::<pthread_rwlockattr_t>() - 4usize];
    ["Offset of field: pthread_rwlockattr_t::__attr"]
        [::core::mem::offset_of!(pthread_rwlockattr_t, __attr) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __bits: [::core::ffi::c_ulong; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sigset_t"][::core::mem::size_of::<__sigset_t>() - 128usize];
    ["Alignment of __sigset_t"][::core::mem::align_of::<__sigset_t>() - 8usize];
    ["Offset of field: __sigset_t::__bits"][::core::mem::offset_of!(__sigset_t, __bits) - 0usize];
};
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pthread_attr_t {
    pub __u: pthread_attr_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t__bindgen_ty_1 {
    pub __i: [::core::ffi::c_int; 14usize],
    pub __vi: [::core::ffi::c_int; 14usize],
    pub __s: [::core::ffi::c_ulong; 7usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_attr_t__bindgen_ty_1"]
        [::core::mem::size_of::<pthread_attr_t__bindgen_ty_1>() - 56usize];
    ["Alignment of pthread_attr_t__bindgen_ty_1"]
        [::core::mem::align_of::<pthread_attr_t__bindgen_ty_1>() - 8usize];
    ["Offset of field: pthread_attr_t__bindgen_ty_1::__i"]
        [::core::mem::offset_of!(pthread_attr_t__bindgen_ty_1, __i) - 0usize];
    ["Offset of field: pthread_attr_t__bindgen_ty_1::__vi"]
        [::core::mem::offset_of!(pthread_attr_t__bindgen_ty_1, __vi) - 0usize];
    ["Offset of field: pthread_attr_t__bindgen_ty_1::__s"]
        [::core::mem::offset_of!(pthread_attr_t__bindgen_ty_1, __s) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_attr_t"][::core::mem::size_of::<pthread_attr_t>() - 56usize];
    ["Alignment of pthread_attr_t"][::core::mem::align_of::<pthread_attr_t>() - 8usize];
    ["Offset of field: pthread_attr_t::__u"][::core::mem::offset_of!(pthread_attr_t, __u) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pthread_mutex_t {
    pub __u: pthread_mutex_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t__bindgen_ty_1 {
    pub __i: [::core::ffi::c_int; 10usize],
    pub __vi: [::core::ffi::c_int; 10usize],
    pub __p: [*mut ::core::ffi::c_void; 5usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutex_t__bindgen_ty_1"]
        [::core::mem::size_of::<pthread_mutex_t__bindgen_ty_1>() - 40usize];
    ["Alignment of pthread_mutex_t__bindgen_ty_1"]
        [::core::mem::align_of::<pthread_mutex_t__bindgen_ty_1>() - 8usize];
    ["Offset of field: pthread_mutex_t__bindgen_ty_1::__i"]
        [::core::mem::offset_of!(pthread_mutex_t__bindgen_ty_1, __i) - 0usize];
    ["Offset of field: pthread_mutex_t__bindgen_ty_1::__vi"]
        [::core::mem::offset_of!(pthread_mutex_t__bindgen_ty_1, __vi) - 0usize];
    ["Offset of field: pthread_mutex_t__bindgen_ty_1::__p"]
        [::core::mem::offset_of!(pthread_mutex_t__bindgen_ty_1, __p) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutex_t"][::core::mem::size_of::<pthread_mutex_t>() - 40usize];
    ["Alignment of pthread_mutex_t"][::core::mem::align_of::<pthread_mutex_t>() - 8usize];
    ["Offset of field: pthread_mutex_t::__u"]
        [::core::mem::offset_of!(pthread_mutex_t, __u) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pthread_cond_t {
    pub __u: pthread_cond_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t__bindgen_ty_1 {
    pub __i: [::core::ffi::c_int; 12usize],
    pub __vi: [::core::ffi::c_int; 12usize],
    pub __p: [*mut ::core::ffi::c_void; 6usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_cond_t__bindgen_ty_1"]
        [::core::mem::size_of::<pthread_cond_t__bindgen_ty_1>() - 48usize];
    ["Alignment of pthread_cond_t__bindgen_ty_1"]
        [::core::mem::align_of::<pthread_cond_t__bindgen_ty_1>() - 8usize];
    ["Offset of field: pthread_cond_t__bindgen_ty_1::__i"]
        [::core::mem::offset_of!(pthread_cond_t__bindgen_ty_1, __i) - 0usize];
    ["Offset of field: pthread_cond_t__bindgen_ty_1::__vi"]
        [::core::mem::offset_of!(pthread_cond_t__bindgen_ty_1, __vi) - 0usize];
    ["Offset of field: pthread_cond_t__bindgen_ty_1::__p"]
        [::core::mem::offset_of!(pthread_cond_t__bindgen_ty_1, __p) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_cond_t"][::core::mem::size_of::<pthread_cond_t>() - 48usize];
    ["Alignment of pthread_cond_t"][::core::mem::align_of::<pthread_cond_t>() - 8usize];
    ["Offset of field: pthread_cond_t::__u"][::core::mem::offset_of!(pthread_cond_t, __u) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pthread_rwlock_t {
    pub __u: pthread_rwlock_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t__bindgen_ty_1 {
    pub __i: [::core::ffi::c_int; 14usize],
    pub __vi: [::core::ffi::c_int; 14usize],
    pub __p: [*mut ::core::ffi::c_void; 7usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlock_t__bindgen_ty_1"]
        [::core::mem::size_of::<pthread_rwlock_t__bindgen_ty_1>() - 56usize];
    ["Alignment of pthread_rwlock_t__bindgen_ty_1"]
        [::core::mem::align_of::<pthread_rwlock_t__bindgen_ty_1>() - 8usize];
    ["Offset of field: pthread_rwlock_t__bindgen_ty_1::__i"]
        [::core::mem::offset_of!(pthread_rwlock_t__bindgen_ty_1, __i) - 0usize];
    ["Offset of field: pthread_rwlock_t__bindgen_ty_1::__vi"]
        [::core::mem::offset_of!(pthread_rwlock_t__bindgen_ty_1, __vi) - 0usize];
    ["Offset of field: pthread_rwlock_t__bindgen_ty_1::__p"]
        [::core::mem::offset_of!(pthread_rwlock_t__bindgen_ty_1, __p) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlock_t"][::core::mem::size_of::<pthread_rwlock_t>() - 56usize];
    ["Alignment of pthread_rwlock_t"][::core::mem::align_of::<pthread_rwlock_t>() - 8usize];
    ["Offset of field: pthread_rwlock_t::__u"]
        [::core::mem::offset_of!(pthread_rwlock_t, __u) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pthread_barrier_t {
    pub __u: pthread_barrier_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t__bindgen_ty_1 {
    pub __i: [::core::ffi::c_int; 8usize],
    pub __vi: [::core::ffi::c_int; 8usize],
    pub __p: [*mut ::core::ffi::c_void; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrier_t__bindgen_ty_1"]
        [::core::mem::size_of::<pthread_barrier_t__bindgen_ty_1>() - 32usize];
    ["Alignment of pthread_barrier_t__bindgen_ty_1"]
        [::core::mem::align_of::<pthread_barrier_t__bindgen_ty_1>() - 8usize];
    ["Offset of field: pthread_barrier_t__bindgen_ty_1::__i"]
        [::core::mem::offset_of!(pthread_barrier_t__bindgen_ty_1, __i) - 0usize];
    ["Offset of field: pthread_barrier_t__bindgen_ty_1::__vi"]
        [::core::mem::offset_of!(pthread_barrier_t__bindgen_ty_1, __vi) - 0usize];
    ["Offset of field: pthread_barrier_t__bindgen_ty_1::__p"]
        [::core::mem::offset_of!(pthread_barrier_t__bindgen_ty_1, __p) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrier_t"][::core::mem::size_of::<pthread_barrier_t>() - 32usize];
    ["Alignment of pthread_barrier_t"][::core::mem::align_of::<pthread_barrier_t>() - 8usize];
    ["Offset of field: pthread_barrier_t::__u"]
        [::core::mem::offset_of!(pthread_barrier_t, __u) - 0usize];
};
pub type pid_t = ::core::ffi::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sched_param {
    pub sched_priority: ::core::ffi::c_int,
    pub __reserved1: ::core::ffi::c_int,
    pub __reserved2: [sched_param__bindgen_ty_1; 2usize],
    pub __reserved3: ::core::ffi::c_int,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sched_param__bindgen_ty_1 {
    pub __reserved1: time_t,
    pub __reserved2: ::core::ffi::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sched_param__bindgen_ty_1"]
        [::core::mem::size_of::<sched_param__bindgen_ty_1>() - 16usize];
    ["Alignment of sched_param__bindgen_ty_1"]
        [::core::mem::align_of::<sched_param__bindgen_ty_1>() - 8usize];
    ["Offset of field: sched_param__bindgen_ty_1::__reserved1"]
        [::core::mem::offset_of!(sched_param__bindgen_ty_1, __reserved1) - 0usize];
    ["Offset of field: sched_param__bindgen_ty_1::__reserved2"]
        [::core::mem::offset_of!(sched_param__bindgen_ty_1, __reserved2) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sched_param"][::core::mem::size_of::<sched_param>() - 48usize];
    ["Alignment of sched_param"][::core::mem::align_of::<sched_param>() - 8usize];
    ["Offset of field: sched_param::sched_priority"]
        [::core::mem::offset_of!(sched_param, sched_priority) - 0usize];
    ["Offset of field: sched_param::__reserved1"]
        [::core::mem::offset_of!(sched_param, __reserved1) - 4usize];
    ["Offset of field: sched_param::__reserved2"]
        [::core::mem::offset_of!(sched_param, __reserved2) - 8usize];
    ["Offset of field: sched_param::__reserved3"]
        [::core::mem::offset_of!(sched_param, __reserved3) - 40usize];
};
unsafe extern "C" {
    pub fn sched_get_priority_max(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sched_get_priority_min(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sched_getparam(arg1: pid_t, arg2: *mut sched_param) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sched_getscheduler(arg1: pid_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sched_rr_get_interval(arg1: pid_t, arg2: *mut timespec) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sched_setparam(arg1: pid_t, arg2: *const sched_param) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sched_setscheduler(
        arg1: pid_t,
        arg2: ::core::ffi::c_int,
        arg3: *const sched_param,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sched_yield() -> ::core::ffi::c_int;
}
pub type timer_t = *mut ::core::ffi::c_void;
pub type clock_t = ::core::ffi::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    _unused: [u8; 0],
}
pub type locale_t = *mut __locale_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm {
    pub tm_sec: ::core::ffi::c_int,
    pub tm_min: ::core::ffi::c_int,
    pub tm_hour: ::core::ffi::c_int,
    pub tm_mday: ::core::ffi::c_int,
    pub tm_mon: ::core::ffi::c_int,
    pub tm_year: ::core::ffi::c_int,
    pub tm_wday: ::core::ffi::c_int,
    pub tm_yday: ::core::ffi::c_int,
    pub tm_isdst: ::core::ffi::c_int,
    pub tm_gmtoff: ::core::ffi::c_long,
    pub tm_zone: *const ::core::ffi::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tm"][::core::mem::size_of::<tm>() - 56usize];
    ["Alignment of tm"][::core::mem::align_of::<tm>() - 8usize];
    ["Offset of field: tm::tm_sec"][::core::mem::offset_of!(tm, tm_sec) - 0usize];
    ["Offset of field: tm::tm_min"][::core::mem::offset_of!(tm, tm_min) - 4usize];
    ["Offset of field: tm::tm_hour"][::core::mem::offset_of!(tm, tm_hour) - 8usize];
    ["Offset of field: tm::tm_mday"][::core::mem::offset_of!(tm, tm_mday) - 12usize];
    ["Offset of field: tm::tm_mon"][::core::mem::offset_of!(tm, tm_mon) - 16usize];
    ["Offset of field: tm::tm_year"][::core::mem::offset_of!(tm, tm_year) - 20usize];
    ["Offset of field: tm::tm_wday"][::core::mem::offset_of!(tm, tm_wday) - 24usize];
    ["Offset of field: tm::tm_yday"][::core::mem::offset_of!(tm, tm_yday) - 28usize];
    ["Offset of field: tm::tm_isdst"][::core::mem::offset_of!(tm, tm_isdst) - 32usize];
    ["Offset of field: tm::tm_gmtoff"][::core::mem::offset_of!(tm, tm_gmtoff) - 40usize];
    ["Offset of field: tm::tm_zone"][::core::mem::offset_of!(tm, tm_zone) - 48usize];
};
unsafe extern "C" {
    pub fn clock() -> clock_t;
}
unsafe extern "C" {
    pub fn time(arg1: *mut time_t) -> time_t;
}
unsafe extern "C" {
    pub fn difftime(arg1: time_t, arg2: time_t) -> f64;
}
unsafe extern "C" {
    pub fn mktime(arg1: *mut tm) -> time_t;
}
unsafe extern "C" {
    pub fn strftime(
        arg1: *mut ::core::ffi::c_char,
        arg2: usize,
        arg3: *const ::core::ffi::c_char,
        arg4: *const tm,
    ) -> usize;
}
unsafe extern "C" {
    pub fn gmtime(arg1: *const time_t) -> *mut tm;
}
unsafe extern "C" {
    pub fn localtime(arg1: *const time_t) -> *mut tm;
}
unsafe extern "C" {
    pub fn asctime(arg1: *const tm) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn ctime(arg1: *const time_t) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn timespec_get(arg1: *mut timespec, arg2: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn strftime_l(
        arg1: *mut ::core::ffi::c_char,
        arg2: usize,
        arg3: *const ::core::ffi::c_char,
        arg4: *const tm,
        arg5: locale_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn gmtime_r(arg1: *const time_t, arg2: *mut tm) -> *mut tm;
}
unsafe extern "C" {
    pub fn localtime_r(arg1: *const time_t, arg2: *mut tm) -> *mut tm;
}
unsafe extern "C" {
    pub fn asctime_r(arg1: *const tm, arg2: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn ctime_r(arg1: *const time_t, arg2: *mut ::core::ffi::c_char)
        -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn tzset();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct itimerspec {
    pub it_interval: timespec,
    pub it_value: timespec,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of itimerspec"][::core::mem::size_of::<itimerspec>() - 32usize];
    ["Alignment of itimerspec"][::core::mem::align_of::<itimerspec>() - 8usize];
    ["Offset of field: itimerspec::it_interval"]
        [::core::mem::offset_of!(itimerspec, it_interval) - 0usize];
    ["Offset of field: itimerspec::it_value"]
        [::core::mem::offset_of!(itimerspec, it_value) - 16usize];
};
unsafe extern "C" {
    pub fn nanosleep(arg1: *const timespec, arg2: *mut timespec) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn clock_getres(arg1: clockid_t, arg2: *mut timespec) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn clock_gettime(arg1: clockid_t, arg2: *mut timespec) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn clock_settime(arg1: clockid_t, arg2: *const timespec) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn clock_nanosleep(
        arg1: clockid_t,
        arg2: ::core::ffi::c_int,
        arg3: *const timespec,
        arg4: *mut timespec,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn clock_getcpuclockid(arg1: pid_t, arg2: *mut clockid_t) -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigevent {
    _unused: [u8; 0],
}
unsafe extern "C" {
    pub fn timer_create(
        arg1: clockid_t,
        arg2: *mut sigevent,
        arg3: *mut timer_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn timer_delete(arg1: timer_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn timer_settime(
        arg1: timer_t,
        arg2: ::core::ffi::c_int,
        arg3: *const itimerspec,
        arg4: *mut itimerspec,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn timer_gettime(arg1: timer_t, arg2: *mut itimerspec) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn timer_getoverrun(arg1: timer_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub static mut tzname: [*mut ::core::ffi::c_char; 2usize];
}
unsafe extern "C" {
    pub fn strptime(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: *mut tm,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub static mut daylight: ::core::ffi::c_int;
}
unsafe extern "C" {
    pub static mut timezone: ::core::ffi::c_long;
}
unsafe extern "C" {
    pub static mut getdate_err: ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn getdate(arg1: *const ::core::ffi::c_char) -> *mut tm;
}
unsafe extern "C" {
    pub fn stime(arg1: *const time_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn timegm(arg1: *mut tm) -> time_t;
}
unsafe extern "C" {
    pub fn pthread_create(
        arg1: *mut pthread_t,
        arg2: *const pthread_attr_t,
        arg3: ::core::option::Option<
            unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void) -> *mut ::core::ffi::c_void,
        >,
        arg4: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_detach(arg1: pthread_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_exit(arg1: *mut ::core::ffi::c_void);
}
unsafe extern "C" {
    pub fn pthread_join(arg1: pthread_t, arg2: *mut *mut ::core::ffi::c_void)
        -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_self() -> pthread_t;
}
unsafe extern "C" {
    pub fn pthread_equal(arg1: pthread_t, arg2: pthread_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_setcancelstate(
        arg1: ::core::ffi::c_int,
        arg2: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_setcanceltype(
        arg1: ::core::ffi::c_int,
        arg2: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_testcancel();
}
unsafe extern "C" {
    pub fn pthread_cancel(arg1: pthread_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_getschedparam(
        arg1: pthread_t,
        arg2: *mut ::core::ffi::c_int,
        arg3: *mut sched_param,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_setschedparam(
        arg1: pthread_t,
        arg2: ::core::ffi::c_int,
        arg3: *const sched_param,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_setschedprio(arg1: pthread_t, arg2: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_once(
        arg1: *mut pthread_once_t,
        arg2: ::core::option::Option<unsafe extern "C" fn()>,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutex_init(
        arg1: *mut pthread_mutex_t,
        arg2: *const pthread_mutexattr_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutex_lock(arg1: *mut pthread_mutex_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutex_unlock(arg1: *mut pthread_mutex_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutex_trylock(arg1: *mut pthread_mutex_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutex_timedlock(
        arg1: *mut pthread_mutex_t,
        arg2: *const timespec,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutex_destroy(arg1: *mut pthread_mutex_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutex_consistent(arg1: *mut pthread_mutex_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutex_getprioceiling(
        arg1: *const pthread_mutex_t,
        arg2: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutex_setprioceiling(
        arg1: *mut pthread_mutex_t,
        arg2: ::core::ffi::c_int,
        arg3: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_cond_init(
        arg1: *mut pthread_cond_t,
        arg2: *const pthread_condattr_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_cond_destroy(arg1: *mut pthread_cond_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_cond_wait(
        arg1: *mut pthread_cond_t,
        arg2: *mut pthread_mutex_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_cond_timedwait(
        arg1: *mut pthread_cond_t,
        arg2: *mut pthread_mutex_t,
        arg3: *const timespec,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_cond_broadcast(arg1: *mut pthread_cond_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_cond_signal(arg1: *mut pthread_cond_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_init(
        arg1: *mut pthread_rwlock_t,
        arg2: *const pthread_rwlockattr_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_destroy(arg1: *mut pthread_rwlock_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_rdlock(arg1: *mut pthread_rwlock_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_tryrdlock(arg1: *mut pthread_rwlock_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_timedrdlock(
        arg1: *mut pthread_rwlock_t,
        arg2: *const timespec,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_wrlock(arg1: *mut pthread_rwlock_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_trywrlock(arg1: *mut pthread_rwlock_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_timedwrlock(
        arg1: *mut pthread_rwlock_t,
        arg2: *const timespec,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_unlock(arg1: *mut pthread_rwlock_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_spin_init(
        arg1: *mut pthread_spinlock_t,
        arg2: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_spin_destroy(arg1: *mut pthread_spinlock_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_spin_lock(arg1: *mut pthread_spinlock_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_spin_trylock(arg1: *mut pthread_spinlock_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_spin_unlock(arg1: *mut pthread_spinlock_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_barrier_init(
        arg1: *mut pthread_barrier_t,
        arg2: *const pthread_barrierattr_t,
        arg3: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_barrier_destroy(arg1: *mut pthread_barrier_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_barrier_wait(arg1: *mut pthread_barrier_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_key_create(
        arg1: *mut pthread_key_t,
        arg2: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_key_delete(arg1: pthread_key_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_getspecific(arg1: pthread_key_t) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn pthread_setspecific(
        arg1: pthread_key_t,
        arg2: *const ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_init(arg1: *mut pthread_attr_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_destroy(arg1: *mut pthread_attr_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getguardsize(
        arg1: *const pthread_attr_t,
        arg2: *mut usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setguardsize(arg1: *mut pthread_attr_t, arg2: usize) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getstacksize(
        arg1: *const pthread_attr_t,
        arg2: *mut usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setstacksize(arg1: *mut pthread_attr_t, arg2: usize) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getdetachstate(
        arg1: *const pthread_attr_t,
        arg2: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setdetachstate(
        arg1: *mut pthread_attr_t,
        arg2: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getstack(
        arg1: *const pthread_attr_t,
        arg2: *mut *mut ::core::ffi::c_void,
        arg3: *mut usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setstack(
        arg1: *mut pthread_attr_t,
        arg2: *mut ::core::ffi::c_void,
        arg3: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getscope(
        arg1: *const pthread_attr_t,
        arg2: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setscope(
        arg1: *mut pthread_attr_t,
        arg2: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getschedpolicy(
        arg1: *const pthread_attr_t,
        arg2: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setschedpolicy(
        arg1: *mut pthread_attr_t,
        arg2: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getschedparam(
        arg1: *const pthread_attr_t,
        arg2: *mut sched_param,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setschedparam(
        arg1: *mut pthread_attr_t,
        arg2: *const sched_param,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getinheritsched(
        arg1: *const pthread_attr_t,
        arg2: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setinheritsched(
        arg1: *mut pthread_attr_t,
        arg2: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_destroy(arg1: *mut pthread_mutexattr_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_getprioceiling(
        arg1: *const pthread_mutexattr_t,
        arg2: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_getprotocol(
        arg1: *const pthread_mutexattr_t,
        arg2: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_getpshared(
        arg1: *const pthread_mutexattr_t,
        arg2: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_getrobust(
        arg1: *const pthread_mutexattr_t,
        arg2: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_gettype(
        arg1: *const pthread_mutexattr_t,
        arg2: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_init(arg1: *mut pthread_mutexattr_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_setprioceiling(
        arg1: *mut pthread_mutexattr_t,
        arg2: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_setprotocol(
        arg1: *mut pthread_mutexattr_t,
        arg2: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_setpshared(
        arg1: *mut pthread_mutexattr_t,
        arg2: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_setrobust(
        arg1: *mut pthread_mutexattr_t,
        arg2: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_settype(
        arg1: *mut pthread_mutexattr_t,
        arg2: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_condattr_init(arg1: *mut pthread_condattr_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_condattr_destroy(arg1: *mut pthread_condattr_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_condattr_setclock(
        arg1: *mut pthread_condattr_t,
        arg2: clockid_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_condattr_setpshared(
        arg1: *mut pthread_condattr_t,
        arg2: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_condattr_getclock(
        arg1: *const pthread_condattr_t,
        arg2: *mut clockid_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_condattr_getpshared(
        arg1: *const pthread_condattr_t,
        arg2: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlockattr_init(arg1: *mut pthread_rwlockattr_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlockattr_destroy(arg1: *mut pthread_rwlockattr_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlockattr_setpshared(
        arg1: *mut pthread_rwlockattr_t,
        arg2: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlockattr_getpshared(
        arg1: *const pthread_rwlockattr_t,
        arg2: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_barrierattr_destroy(arg1: *mut pthread_barrierattr_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_barrierattr_getpshared(
        arg1: *const pthread_barrierattr_t,
        arg2: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_barrierattr_init(arg1: *mut pthread_barrierattr_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_barrierattr_setpshared(
        arg1: *mut pthread_barrierattr_t,
        arg2: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_atfork(
        arg1: ::core::option::Option<unsafe extern "C" fn()>,
        arg2: ::core::option::Option<unsafe extern "C" fn()>,
        arg3: ::core::option::Option<unsafe extern "C" fn()>,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_getconcurrency() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_setconcurrency(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_getcpuclockid(arg1: pthread_t, arg2: *mut clockid_t) -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __ptcb {
    pub __f: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    pub __x: *mut ::core::ffi::c_void,
    pub __next: *mut __ptcb,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __ptcb"][::core::mem::size_of::<__ptcb>() - 24usize];
    ["Alignment of __ptcb"][::core::mem::align_of::<__ptcb>() - 8usize];
    ["Offset of field: __ptcb::__f"][::core::mem::offset_of!(__ptcb, __f) - 0usize];
    ["Offset of field: __ptcb::__x"][::core::mem::offset_of!(__ptcb, __x) - 8usize];
    ["Offset of field: __ptcb::__next"][::core::mem::offset_of!(__ptcb, __next) - 16usize];
};
unsafe extern "C" {
    pub fn _pthread_cleanup_push(
        arg1: *mut __ptcb,
        arg2: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
        arg3: *mut ::core::ffi::c_void,
    );
}
unsafe extern "C" {
    pub fn _pthread_cleanup_pop(arg1: *mut __ptcb, arg2: ::core::ffi::c_int);
}
pub type s_thread_t = pthread_t;
pub type s_thread_key_t = pthread_key_t;
pub type s_thread_mutex_t = pthread_mutex_t;
pub type s_thread_cond_t = pthread_cond_t;
pub type s_thread_rv_t = *mut ::core::ffi::c_void;
pub type bigit = U32;
pub type bigitbigit = U64;
pub type ibigit = I32;
pub type ibigitbigit = I64;
pub type INT = ::core::ffi::c_int;
pub type UINT = ::core::ffi::c_uint;
pub type ITYPE = ::core::ffi::c_int;
pub type ISPC = ::core::ffi::c_int;
pub type IGEN = ::core::ffi::c_int;
pub type IDIRTYBYTE = ::core::ffi::c_int;
pub type IBOOL = ::core::ffi::c_int;
pub type ICHAR = ::core::ffi::c_int;
pub type IFASLCODE = ::core::ffi::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _seginfo {
    pub space: ::core::ffi::c_uchar,
    pub generation: ::core::ffi::c_uchar,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub min_dirty_byte: octet,
    pub list_bits: *mut octet,
    pub number: uptr,
    pub creator: *mut thread_gc,
    pub chunk: *mut _chunkinfo,
    pub next: *mut _seginfo,
    pub sweep_next: *mut _seginfo,
    pub sweep_start: ptr,
    pub dirty_prev: *mut *mut _seginfo,
    pub dirty_next: *mut _seginfo,
    pub trigger_ephemerons: ptr,
    pub trigger_guardians: ptr,
    pub marked_mask: *mut octet,
    pub marked_count: uptr,
    pub forwarded_flonums: *mut octet,
    pub counting_mask: *mut octet,
    pub measured_mask: *mut octet,
    pub dirty_bytes: [octet; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _seginfo"][::core::mem::size_of::<_seginfo>() - 168usize];
    ["Alignment of _seginfo"][::core::mem::align_of::<_seginfo>() - 8usize];
    ["Offset of field: _seginfo::space"][::core::mem::offset_of!(_seginfo, space) - 0usize];
    ["Offset of field: _seginfo::generation"]
        [::core::mem::offset_of!(_seginfo, generation) - 1usize];
    ["Offset of field: _seginfo::min_dirty_byte"]
        [::core::mem::offset_of!(_seginfo, min_dirty_byte) - 3usize];
    ["Offset of field: _seginfo::list_bits"][::core::mem::offset_of!(_seginfo, list_bits) - 8usize];
    ["Offset of field: _seginfo::number"][::core::mem::offset_of!(_seginfo, number) - 16usize];
    ["Offset of field: _seginfo::creator"][::core::mem::offset_of!(_seginfo, creator) - 24usize];
    ["Offset of field: _seginfo::chunk"][::core::mem::offset_of!(_seginfo, chunk) - 32usize];
    ["Offset of field: _seginfo::next"][::core::mem::offset_of!(_seginfo, next) - 40usize];
    ["Offset of field: _seginfo::sweep_next"]
        [::core::mem::offset_of!(_seginfo, sweep_next) - 48usize];
    ["Offset of field: _seginfo::sweep_start"]
        [::core::mem::offset_of!(_seginfo, sweep_start) - 56usize];
    ["Offset of field: _seginfo::dirty_prev"]
        [::core::mem::offset_of!(_seginfo, dirty_prev) - 64usize];
    ["Offset of field: _seginfo::dirty_next"]
        [::core::mem::offset_of!(_seginfo, dirty_next) - 72usize];
    ["Offset of field: _seginfo::trigger_ephemerons"]
        [::core::mem::offset_of!(_seginfo, trigger_ephemerons) - 80usize];
    ["Offset of field: _seginfo::trigger_guardians"]
        [::core::mem::offset_of!(_seginfo, trigger_guardians) - 88usize];
    ["Offset of field: _seginfo::marked_mask"]
        [::core::mem::offset_of!(_seginfo, marked_mask) - 96usize];
    ["Offset of field: _seginfo::marked_count"]
        [::core::mem::offset_of!(_seginfo, marked_count) - 104usize];
    ["Offset of field: _seginfo::forwarded_flonums"]
        [::core::mem::offset_of!(_seginfo, forwarded_flonums) - 112usize];
    ["Offset of field: _seginfo::counting_mask"]
        [::core::mem::offset_of!(_seginfo, counting_mask) - 120usize];
    ["Offset of field: _seginfo::measured_mask"]
        [::core::mem::offset_of!(_seginfo, measured_mask) - 128usize];
    ["Offset of field: _seginfo::dirty_bytes"]
        [::core::mem::offset_of!(_seginfo, dirty_bytes) - 136usize];
};
impl _seginfo {
    #[inline]
    pub fn old_space(&self) -> ::core::ffi::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_old_space(&mut self, val: ::core::ffi::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn old_space_raw(this: *const Self) -> ::core::ffi::c_uchar {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_old_space_raw(this: *mut Self, val: ::core::ffi::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn use_marks(&self) -> ::core::ffi::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_use_marks(&mut self, val: ::core::ffi::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn use_marks_raw(this: *const Self) -> ::core::ffi::c_uchar {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_use_marks_raw(this: *mut Self, val: ::core::ffi::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn sorted(&self) -> ::core::ffi::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_sorted(&mut self, val: ::core::ffi::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn sorted_raw(this: *const Self) -> ::core::ffi::c_uchar {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_sorted_raw(this: *mut Self, val: ::core::ffi::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn has_triggers(&self) -> ::core::ffi::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_has_triggers(&mut self, val: ::core::ffi::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn has_triggers_raw(this: *const Self) -> ::core::ffi::c_uchar {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_has_triggers_raw(this: *mut Self, val: ::core::ffi::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn must_mark(&self) -> ::core::ffi::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_must_mark(&mut self, val: ::core::ffi::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn must_mark_raw(this: *const Self) -> ::core::ffi::c_uchar {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                2u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_must_mark_raw(this: *mut Self, val: ::core::ffi::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        old_space: ::core::ffi::c_uchar,
        use_marks: ::core::ffi::c_uchar,
        sorted: ::core::ffi::c_uchar,
        has_triggers: ::core::ffi::c_uchar,
        must_mark: ::core::ffi::c_uchar,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let old_space: u8 = unsafe { ::core::mem::transmute(old_space) };
            old_space as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let use_marks: u8 = unsafe { ::core::mem::transmute(use_marks) };
            use_marks as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let sorted: u8 = unsafe { ::core::mem::transmute(sorted) };
            sorted as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let has_triggers: u8 = unsafe { ::core::mem::transmute(has_triggers) };
            has_triggers as u64
        });
        __bindgen_bitfield_unit.set(4usize, 2u8, {
            let must_mark: u8 = unsafe { ::core::mem::transmute(must_mark) };
            must_mark as u64
        });
        __bindgen_bitfield_unit
    }
}
pub type seginfo = _seginfo;
#[repr(C)]
#[derive(Debug)]
pub struct _chunkinfo {
    pub addr: *mut ::core::ffi::c_void,
    pub base: iptr,
    pub bytes: iptr,
    pub segs: iptr,
    pub nused_segs: iptr,
    pub prev: *mut *mut _chunkinfo,
    pub next: *mut _chunkinfo,
    pub unused_segs: *mut _seginfo,
    pub sis: __IncompleteArrayField<_seginfo>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _chunkinfo"][::core::mem::size_of::<_chunkinfo>() - 64usize];
    ["Alignment of _chunkinfo"][::core::mem::align_of::<_chunkinfo>() - 8usize];
    ["Offset of field: _chunkinfo::addr"][::core::mem::offset_of!(_chunkinfo, addr) - 0usize];
    ["Offset of field: _chunkinfo::base"][::core::mem::offset_of!(_chunkinfo, base) - 8usize];
    ["Offset of field: _chunkinfo::bytes"][::core::mem::offset_of!(_chunkinfo, bytes) - 16usize];
    ["Offset of field: _chunkinfo::segs"][::core::mem::offset_of!(_chunkinfo, segs) - 24usize];
    ["Offset of field: _chunkinfo::nused_segs"]
        [::core::mem::offset_of!(_chunkinfo, nused_segs) - 32usize];
    ["Offset of field: _chunkinfo::prev"][::core::mem::offset_of!(_chunkinfo, prev) - 40usize];
    ["Offset of field: _chunkinfo::next"][::core::mem::offset_of!(_chunkinfo, next) - 48usize];
    ["Offset of field: _chunkinfo::unused_segs"]
        [::core::mem::offset_of!(_chunkinfo, unused_segs) - 56usize];
    ["Offset of field: _chunkinfo::sis"][::core::mem::offset_of!(_chunkinfo, sis) - 64usize];
};
pub type chunkinfo = _chunkinfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _t1table {
    pub t1: [*mut seginfo; 65536usize],
    pub refcount: iptr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _t1table"][::core::mem::size_of::<_t1table>() - 524296usize];
    ["Alignment of _t1table"][::core::mem::align_of::<_t1table>() - 8usize];
    ["Offset of field: _t1table::t1"][::core::mem::offset_of!(_t1table, t1) - 0usize];
    ["Offset of field: _t1table::refcount"]
        [::core::mem::offset_of!(_t1table, refcount) - 524288usize];
};
pub type t1table = _t1table;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _t2table {
    pub t2: [*mut t1table; 131072usize],
    pub refcount: iptr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _t2table"][::core::mem::size_of::<_t2table>() - 1048584usize];
    ["Alignment of _t2table"][::core::mem::align_of::<_t2table>() - 8usize];
    ["Offset of field: _t2table::t2"][::core::mem::offset_of!(_t2table, t2) - 0usize];
    ["Offset of field: _t2table::refcount"]
        [::core::mem::offset_of!(_t2table, refcount) - 1048576usize];
};
pub type t2table = _t2table;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _bucket {
    pub sym: ptr,
    pub next: *mut _bucket,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _bucket"][::core::mem::size_of::<_bucket>() - 16usize];
    ["Alignment of _bucket"][::core::mem::align_of::<_bucket>() - 8usize];
    ["Offset of field: _bucket::sym"][::core::mem::offset_of!(_bucket, sym) - 0usize];
    ["Offset of field: _bucket::next"][::core::mem::offset_of!(_bucket, next) - 8usize];
};
pub type bucket = _bucket;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _bucket_list {
    pub car: *mut _bucket,
    pub cdr: *mut _bucket_list,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _bucket_list"][::core::mem::size_of::<_bucket_list>() - 16usize];
    ["Alignment of _bucket_list"][::core::mem::align_of::<_bucket_list>() - 8usize];
    ["Offset of field: _bucket_list::car"][::core::mem::offset_of!(_bucket_list, car) - 0usize];
    ["Offset of field: _bucket_list::cdr"][::core::mem::offset_of!(_bucket_list, cdr) - 8usize];
};
pub type bucket_list = _bucket_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _bucket_pointer_list {
    pub car: *mut *mut _bucket,
    pub cdr: *mut _bucket_pointer_list,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _bucket_pointer_list"][::core::mem::size_of::<_bucket_pointer_list>() - 16usize];
    ["Alignment of _bucket_pointer_list"][::core::mem::align_of::<_bucket_pointer_list>() - 8usize];
    ["Offset of field: _bucket_pointer_list::car"]
        [::core::mem::offset_of!(_bucket_pointer_list, car) - 0usize];
    ["Offset of field: _bucket_pointer_list::cdr"]
        [::core::mem::offset_of!(_bucket_pointer_list, cdr) - 8usize];
};
pub type bucket_pointer_list = _bucket_pointer_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _dirtycardinfo {
    pub card: uptr,
    pub youngest: IGEN,
    pub next: *mut _dirtycardinfo,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _dirtycardinfo"][::core::mem::size_of::<_dirtycardinfo>() - 24usize];
    ["Alignment of _dirtycardinfo"][::core::mem::align_of::<_dirtycardinfo>() - 8usize];
    ["Offset of field: _dirtycardinfo::card"]
        [::core::mem::offset_of!(_dirtycardinfo, card) - 0usize];
    ["Offset of field: _dirtycardinfo::youngest"]
        [::core::mem::offset_of!(_dirtycardinfo, youngest) - 8usize];
    ["Offset of field: _dirtycardinfo::next"]
        [::core::mem::offset_of!(_dirtycardinfo, next) - 16usize];
};
pub type dirtycardinfo = _dirtycardinfo;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct scheme_mutex_t {
    pub owner: s_thread_t,
    pub count: uptr,
    pub pmutex: s_thread_mutex_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of scheme_mutex_t"][::core::mem::size_of::<scheme_mutex_t>() - 56usize];
    ["Alignment of scheme_mutex_t"][::core::mem::align_of::<scheme_mutex_t>() - 8usize];
    ["Offset of field: scheme_mutex_t::owner"]
        [::core::mem::offset_of!(scheme_mutex_t, owner) - 0usize];
    ["Offset of field: scheme_mutex_t::count"]
        [::core::mem::offset_of!(scheme_mutex_t, count) - 8usize];
    ["Offset of field: scheme_mutex_t::pmutex"]
        [::core::mem::offset_of!(scheme_mutex_t, pmutex) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct thread_gc {
    pub tc: ptr,
    pub during_alloc: ::core::ffi::c_int,
    pub queued_fire: IBOOL,
    pub preserve_ownership: IBOOL,
    pub next: *mut thread_gc,
    pub base_loc: [[ptr; 19usize]; 8usize],
    pub next_loc: [[ptr; 19usize]; 8usize],
    pub bytes_left: [[iptr; 19usize]; 8usize],
    pub orig_next_loc: [ptr; 19usize],
    pub sweep_loc: [[ptr; 19usize]; 8usize],
    pub sweep_next: [[*mut seginfo; 19usize]; 8usize],
    pub pending_ephemerons: ptr,
    pub sweep_stack: ptr,
    pub sweep_stack_start: ptr,
    pub sweep_stack_limit: ptr,
    pub sweep_change: ::core::ffi::c_int,
    pub sweeper: ::core::ffi::c_int,
    pub send_remote_sweep_stack: ptr,
    pub send_remote_sweep_stack_start: ptr,
    pub send_remote_sweep_stack_limit: ptr,
    pub receive_remote_sweep_stack: ptr,
    pub receive_remote_sweep_stack_start: ptr,
    pub receive_remote_sweep_stack_limit: ptr,
    pub dirty_segments: [*mut seginfo; 28usize],
    pub bitmask_overhead: [iptr; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of thread_gc"][::core::mem::size_of::<thread_gc>() - 6640usize];
    ["Alignment of thread_gc"][::core::mem::align_of::<thread_gc>() - 8usize];
    ["Offset of field: thread_gc::tc"][::core::mem::offset_of!(thread_gc, tc) - 0usize];
    ["Offset of field: thread_gc::during_alloc"]
        [::core::mem::offset_of!(thread_gc, during_alloc) - 8usize];
    ["Offset of field: thread_gc::queued_fire"]
        [::core::mem::offset_of!(thread_gc, queued_fire) - 12usize];
    ["Offset of field: thread_gc::preserve_ownership"]
        [::core::mem::offset_of!(thread_gc, preserve_ownership) - 16usize];
    ["Offset of field: thread_gc::next"][::core::mem::offset_of!(thread_gc, next) - 24usize];
    ["Offset of field: thread_gc::base_loc"]
        [::core::mem::offset_of!(thread_gc, base_loc) - 32usize];
    ["Offset of field: thread_gc::next_loc"]
        [::core::mem::offset_of!(thread_gc, next_loc) - 1248usize];
    ["Offset of field: thread_gc::bytes_left"]
        [::core::mem::offset_of!(thread_gc, bytes_left) - 2464usize];
    ["Offset of field: thread_gc::orig_next_loc"]
        [::core::mem::offset_of!(thread_gc, orig_next_loc) - 3680usize];
    ["Offset of field: thread_gc::sweep_loc"]
        [::core::mem::offset_of!(thread_gc, sweep_loc) - 3832usize];
    ["Offset of field: thread_gc::sweep_next"]
        [::core::mem::offset_of!(thread_gc, sweep_next) - 5048usize];
    ["Offset of field: thread_gc::pending_ephemerons"]
        [::core::mem::offset_of!(thread_gc, pending_ephemerons) - 6264usize];
    ["Offset of field: thread_gc::sweep_stack"]
        [::core::mem::offset_of!(thread_gc, sweep_stack) - 6272usize];
    ["Offset of field: thread_gc::sweep_stack_start"]
        [::core::mem::offset_of!(thread_gc, sweep_stack_start) - 6280usize];
    ["Offset of field: thread_gc::sweep_stack_limit"]
        [::core::mem::offset_of!(thread_gc, sweep_stack_limit) - 6288usize];
    ["Offset of field: thread_gc::sweep_change"]
        [::core::mem::offset_of!(thread_gc, sweep_change) - 6296usize];
    ["Offset of field: thread_gc::sweeper"]
        [::core::mem::offset_of!(thread_gc, sweeper) - 6300usize];
    ["Offset of field: thread_gc::send_remote_sweep_stack"]
        [::core::mem::offset_of!(thread_gc, send_remote_sweep_stack) - 6304usize];
    ["Offset of field: thread_gc::send_remote_sweep_stack_start"]
        [::core::mem::offset_of!(thread_gc, send_remote_sweep_stack_start) - 6312usize];
    ["Offset of field: thread_gc::send_remote_sweep_stack_limit"]
        [::core::mem::offset_of!(thread_gc, send_remote_sweep_stack_limit) - 6320usize];
    ["Offset of field: thread_gc::receive_remote_sweep_stack"]
        [::core::mem::offset_of!(thread_gc, receive_remote_sweep_stack) - 6328usize];
    ["Offset of field: thread_gc::receive_remote_sweep_stack_start"]
        [::core::mem::offset_of!(thread_gc, receive_remote_sweep_stack_start) - 6336usize];
    ["Offset of field: thread_gc::receive_remote_sweep_stack_limit"]
        [::core::mem::offset_of!(thread_gc, receive_remote_sweep_stack_limit) - 6344usize];
    ["Offset of field: thread_gc::dirty_segments"]
        [::core::mem::offset_of!(thread_gc, dirty_segments) - 6352usize];
    ["Offset of field: thread_gc::bitmask_overhead"]
        [::core::mem::offset_of!(thread_gc, bitmask_overhead) - 6576usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct unbufFaslFileObj {
    pub path: ptr,
    pub type_: INT,
    pub fd: INT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of unbufFaslFileObj"][::core::mem::size_of::<unbufFaslFileObj>() - 16usize];
    ["Alignment of unbufFaslFileObj"][::core::mem::align_of::<unbufFaslFileObj>() - 8usize];
    ["Offset of field: unbufFaslFileObj::path"]
        [::core::mem::offset_of!(unbufFaslFileObj, path) - 0usize];
    ["Offset of field: unbufFaslFileObj::type_"]
        [::core::mem::offset_of!(unbufFaslFileObj, type_) - 8usize];
    ["Offset of field: unbufFaslFileObj::fd"]
        [::core::mem::offset_of!(unbufFaslFileObj, fd) - 12usize];
};
pub type unbufFaslFile = *mut unbufFaslFileObj;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct faslFileObj {
    pub uf: unbufFaslFileObj,
    pub buffer_mode: ::core::ffi::c_int,
    pub remaining: iptr,
    pub next: *mut octet,
    pub end: *mut octet,
    pub buf: *mut octet,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of faslFileObj"][::core::mem::size_of::<faslFileObj>() - 56usize];
    ["Alignment of faslFileObj"][::core::mem::align_of::<faslFileObj>() - 8usize];
    ["Offset of field: faslFileObj::uf"][::core::mem::offset_of!(faslFileObj, uf) - 0usize];
    ["Offset of field: faslFileObj::buffer_mode"]
        [::core::mem::offset_of!(faslFileObj, buffer_mode) - 16usize];
    ["Offset of field: faslFileObj::remaining"]
        [::core::mem::offset_of!(faslFileObj, remaining) - 24usize];
    ["Offset of field: faslFileObj::next"][::core::mem::offset_of!(faslFileObj, next) - 32usize];
    ["Offset of field: faslFileObj::end"][::core::mem::offset_of!(faslFileObj, end) - 40usize];
    ["Offset of field: faslFileObj::buf"][::core::mem::offset_of!(faslFileObj, buf) - 48usize];
};
pub type faslFile = *mut faslFileObj;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fileFaslFileObj {
    pub f: faslFileObj,
    pub buf_space: [octet; 4096usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fileFaslFileObj"][::core::mem::size_of::<fileFaslFileObj>() - 4152usize];
    ["Alignment of fileFaslFileObj"][::core::mem::align_of::<fileFaslFileObj>() - 8usize];
    ["Offset of field: fileFaslFileObj::f"][::core::mem::offset_of!(fileFaslFileObj, f) - 0usize];
    ["Offset of field: fileFaslFileObj::buf_space"]
        [::core::mem::offset_of!(fileFaslFileObj, buf_space) - 56usize];
};
pub type fileFaslFile = *mut fileFaslFileObj;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct glzFile_r {
    pub fd: INT,
    pub inputp: IBOOL,
    pub format: INT,
    pub __bindgen_anon_1: glzFile_r__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union glzFile_r__bindgen_ty_1 {
    pub gz: *mut gzFile_s,
    pub lz4_in: *mut lz4File_in_r,
    pub lz4_out: *mut lz4File_out_r,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of glzFile_r__bindgen_ty_1"][::core::mem::size_of::<glzFile_r__bindgen_ty_1>() - 8usize];
    ["Alignment of glzFile_r__bindgen_ty_1"]
        [::core::mem::align_of::<glzFile_r__bindgen_ty_1>() - 8usize];
    ["Offset of field: glzFile_r__bindgen_ty_1::gz"]
        [::core::mem::offset_of!(glzFile_r__bindgen_ty_1, gz) - 0usize];
    ["Offset of field: glzFile_r__bindgen_ty_1::lz4_in"]
        [::core::mem::offset_of!(glzFile_r__bindgen_ty_1, lz4_in) - 0usize];
    ["Offset of field: glzFile_r__bindgen_ty_1::lz4_out"]
        [::core::mem::offset_of!(glzFile_r__bindgen_ty_1, lz4_out) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of glzFile_r"][::core::mem::size_of::<glzFile_r>() - 24usize];
    ["Alignment of glzFile_r"][::core::mem::align_of::<glzFile_r>() - 8usize];
    ["Offset of field: glzFile_r::fd"][::core::mem::offset_of!(glzFile_r, fd) - 0usize];
    ["Offset of field: glzFile_r::inputp"][::core::mem::offset_of!(glzFile_r, inputp) - 4usize];
    ["Offset of field: glzFile_r::format"][::core::mem::offset_of!(glzFile_r, format) - 8usize];
};
pub type glzFile = *mut glzFile_r;
unsafe extern "C" {
    pub static mut S_checkheap: IBOOL;
}
unsafe extern "C" {
    pub static mut S_checkheap_errors: uptr;
}
unsafe extern "C" {
    pub static mut S_child_processes: [ptr; 8usize];
}
unsafe extern "C" {
    pub static mut S_boot_time: IBOOL;
}
unsafe extern "C" {
    pub static mut S_vfasl_boot_mode: ::core::ffi::c_int;
}
unsafe extern "C" {
    pub static mut S_errors_to_console: IBOOL;
}
unsafe extern "C" {
    pub static mut S_threads: ptr;
}
unsafe extern "C" {
    pub static mut S_nthreads: uptr;
}
unsafe extern "C" {
    pub static mut S_pagesize: uptr;
}
unsafe extern "C" {
    pub static mut S_abnormal_exit_proc: ::core::option::Option<unsafe extern "C" fn()>;
}
unsafe extern "C" {
    pub static mut Sschemeheapdirs: *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub static mut Sdefaultheapdirs: *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub static mut S_tc_key: s_thread_key_t;
}
unsafe extern "C" {
    pub static mut S_tc_mutex: scheme_mutex_t;
}
unsafe extern "C" {
    pub static mut S_collect_cond: s_thread_cond_t;
}
unsafe extern "C" {
    pub static mut S_collect_thread0_cond: s_thread_cond_t;
}
unsafe extern "C" {
    pub static mut S_tc_mutex_depth: INT;
}
unsafe extern "C" {
    pub static mut S_alloc_mutex: scheme_mutex_t;
}
unsafe extern "C" {
    pub static mut S_alloc_mutex_depth: INT;
}
unsafe extern "C" {
    pub static mut S_terminated_cond: s_thread_cond_t;
}
unsafe extern "C" {
    pub static mut S_collect_waiting_threads: ::core::ffi::c_int;
}
unsafe extern "C" {
    pub static mut S_collect_waiting_tcs: [ptr; 16usize];
}
unsafe extern "C" {
    pub static mut S_num_preserve_ownership_threads: ::core::ffi::c_int;
}
unsafe extern "C" {
    pub static mut S_main_thread_id: s_thread_t;
}
unsafe extern "C" {
    pub static mut S_segment_info: [*mut t2table; 131072usize];
}
unsafe extern "C" {
    pub static mut S_chunks_full: *mut chunkinfo;
}
unsafe extern "C" {
    pub static mut S_chunks: [*mut chunkinfo; 9usize];
}
unsafe extern "C" {
    pub static mut S_code_chunks_full: *mut chunkinfo;
}
unsafe extern "C" {
    pub static mut S_code_chunks: [*mut chunkinfo; 9usize];
}
unsafe extern "C" {
    pub static mut S_foreign_dynamic: ptr;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct S_G_struct {
    pub thread_context: [f64; 96usize],
    pub main_thread_gc: thread_gc,
    pub active_threads_id: ptr,
    pub error_invoke_code_object: ptr,
    pub invoke_code_object: ptr,
    pub dummy_code_object: ptr,
    pub heap_reserve_ratio_id: ptr,
    pub retain_static_relocation: IBOOL,
    pub enable_object_counts: IBOOL,
    pub enable_object_backreferences: IBOOL,
    pub scheme_version_id: ptr,
    pub make_load_binary_id: ptr,
    pub load_binary: ptr,
    pub profile_counters: ptr,
    pub foreign_static: ptr,
    pub foreign_names: ptr,
    pub threadno: ptr,
    pub occupied_segments: [[*mut seginfo; 19usize]; 8usize],
    pub number_of_nonstatic_segments: uptr,
    pub number_of_empty_segments: uptr,
    pub protected: [*mut ptr; 100usize],
    pub protect_next: uptr,
    pub bytes_of_space: [[uptr; 19usize]; 8usize],
    pub bytes_of_generation: [uptr; 8usize],
    pub bitmask_overhead: [uptr; 8usize],
    pub g0_bytes_after_last_gc: uptr,
    pub collect_trip_bytes: uptr,
    pub nonprocedure_code: ptr,
    pub null_string: ptr,
    pub null_vector: ptr,
    pub null_fxvector: ptr,
    pub null_flvector: ptr,
    pub null_bytevector: ptr,
    pub null_immutable_string: ptr,
    pub null_immutable_vector: ptr,
    pub null_immutable_bytevector: ptr,
    pub zero_length_bignum: ptr,
    pub dirty_segments: [*mut seginfo; 28usize],
    pub error_id: ptr,
    pub nuate_id: ptr,
    pub null_continuation_id: ptr,
    pub collect_request_pending_id: ptr,
    pub event_and_resume_id: ptr,
    pub event_and_resume_star_id: ptr,
    pub guardians: [ptr; 8usize],
    pub locked_objects: [ptr; 8usize],
    pub unlocked_objects: [ptr; 8usize],
    pub min_free_gen: IGEN,
    pub new_min_free_gen: IGEN,
    pub max_nonstatic_generation: IGEN,
    pub new_max_nonstatic_generation: IGEN,
    pub min_mark_gen: IGEN,
    pub countof: [[uptr; 30usize]; 8usize],
    pub bytesof: [[uptr; 30usize]; 8usize],
    pub gctimestamp: [uptr; 8usize],
    pub rtds_with_counts: [ptr; 8usize],
    pub countof_size: [uptr; 30usize],
    pub static_id: ptr,
    pub countof_names: ptr,
    pub gcbackreference: [ptr; 8usize],
    pub prcgeneration: IGEN,
    pub bytes_finalized: uptr,
    pub new_dirty_cards: *mut dirtycardinfo,
    pub must_mark_gen0: IBOOL,
    pub oblist_length: iptr,
    pub oblist_count: iptr,
    pub oblist: *mut *mut bucket,
    pub buckets_of_generation: [*mut bucket_list; 7usize],
    pub library_entry_vector: ptr,
    pub c_entry_vector: ptr,
    pub base_rtd: ptr,
    pub rtd_key: ptr,
    pub eq_symbol: ptr,
    pub eq_ht_rtd: ptr,
    pub symbol_symbol: ptr,
    pub symbol_ht_rtd: ptr,
    pub eqp: ptr,
    pub eqvp: ptr,
    pub equalp: ptr,
    pub symboleqp: ptr,
    pub c_entries: *mut vfasl_hash_table,
    pub library_entries: *mut vfasl_hash_table,
    pub library_entry_codes: *mut vfasl_hash_table,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of S_G_struct"][::core::mem::size_of::<S_G_struct>() - 16008usize];
    ["Alignment of S_G_struct"][::core::mem::align_of::<S_G_struct>() - 8usize];
    ["Offset of field: S_G_struct::thread_context"]
        [::core::mem::offset_of!(S_G_struct, thread_context) - 0usize];
    ["Offset of field: S_G_struct::main_thread_gc"]
        [::core::mem::offset_of!(S_G_struct, main_thread_gc) - 768usize];
    ["Offset of field: S_G_struct::active_threads_id"]
        [::core::mem::offset_of!(S_G_struct, active_threads_id) - 7408usize];
    ["Offset of field: S_G_struct::error_invoke_code_object"]
        [::core::mem::offset_of!(S_G_struct, error_invoke_code_object) - 7416usize];
    ["Offset of field: S_G_struct::invoke_code_object"]
        [::core::mem::offset_of!(S_G_struct, invoke_code_object) - 7424usize];
    ["Offset of field: S_G_struct::dummy_code_object"]
        [::core::mem::offset_of!(S_G_struct, dummy_code_object) - 7432usize];
    ["Offset of field: S_G_struct::heap_reserve_ratio_id"]
        [::core::mem::offset_of!(S_G_struct, heap_reserve_ratio_id) - 7440usize];
    ["Offset of field: S_G_struct::retain_static_relocation"]
        [::core::mem::offset_of!(S_G_struct, retain_static_relocation) - 7448usize];
    ["Offset of field: S_G_struct::enable_object_counts"]
        [::core::mem::offset_of!(S_G_struct, enable_object_counts) - 7452usize];
    ["Offset of field: S_G_struct::enable_object_backreferences"]
        [::core::mem::offset_of!(S_G_struct, enable_object_backreferences) - 7456usize];
    ["Offset of field: S_G_struct::scheme_version_id"]
        [::core::mem::offset_of!(S_G_struct, scheme_version_id) - 7464usize];
    ["Offset of field: S_G_struct::make_load_binary_id"]
        [::core::mem::offset_of!(S_G_struct, make_load_binary_id) - 7472usize];
    ["Offset of field: S_G_struct::load_binary"]
        [::core::mem::offset_of!(S_G_struct, load_binary) - 7480usize];
    ["Offset of field: S_G_struct::profile_counters"]
        [::core::mem::offset_of!(S_G_struct, profile_counters) - 7488usize];
    ["Offset of field: S_G_struct::foreign_static"]
        [::core::mem::offset_of!(S_G_struct, foreign_static) - 7496usize];
    ["Offset of field: S_G_struct::foreign_names"]
        [::core::mem::offset_of!(S_G_struct, foreign_names) - 7504usize];
    ["Offset of field: S_G_struct::threadno"]
        [::core::mem::offset_of!(S_G_struct, threadno) - 7512usize];
    ["Offset of field: S_G_struct::occupied_segments"]
        [::core::mem::offset_of!(S_G_struct, occupied_segments) - 7520usize];
    ["Offset of field: S_G_struct::number_of_nonstatic_segments"]
        [::core::mem::offset_of!(S_G_struct, number_of_nonstatic_segments) - 8736usize];
    ["Offset of field: S_G_struct::number_of_empty_segments"]
        [::core::mem::offset_of!(S_G_struct, number_of_empty_segments) - 8744usize];
    ["Offset of field: S_G_struct::protected"]
        [::core::mem::offset_of!(S_G_struct, protected) - 8752usize];
    ["Offset of field: S_G_struct::protect_next"]
        [::core::mem::offset_of!(S_G_struct, protect_next) - 9552usize];
    ["Offset of field: S_G_struct::bytes_of_space"]
        [::core::mem::offset_of!(S_G_struct, bytes_of_space) - 9560usize];
    ["Offset of field: S_G_struct::bytes_of_generation"]
        [::core::mem::offset_of!(S_G_struct, bytes_of_generation) - 10776usize];
    ["Offset of field: S_G_struct::bitmask_overhead"]
        [::core::mem::offset_of!(S_G_struct, bitmask_overhead) - 10840usize];
    ["Offset of field: S_G_struct::g0_bytes_after_last_gc"]
        [::core::mem::offset_of!(S_G_struct, g0_bytes_after_last_gc) - 10904usize];
    ["Offset of field: S_G_struct::collect_trip_bytes"]
        [::core::mem::offset_of!(S_G_struct, collect_trip_bytes) - 10912usize];
    ["Offset of field: S_G_struct::nonprocedure_code"]
        [::core::mem::offset_of!(S_G_struct, nonprocedure_code) - 10920usize];
    ["Offset of field: S_G_struct::null_string"]
        [::core::mem::offset_of!(S_G_struct, null_string) - 10928usize];
    ["Offset of field: S_G_struct::null_vector"]
        [::core::mem::offset_of!(S_G_struct, null_vector) - 10936usize];
    ["Offset of field: S_G_struct::null_fxvector"]
        [::core::mem::offset_of!(S_G_struct, null_fxvector) - 10944usize];
    ["Offset of field: S_G_struct::null_flvector"]
        [::core::mem::offset_of!(S_G_struct, null_flvector) - 10952usize];
    ["Offset of field: S_G_struct::null_bytevector"]
        [::core::mem::offset_of!(S_G_struct, null_bytevector) - 10960usize];
    ["Offset of field: S_G_struct::null_immutable_string"]
        [::core::mem::offset_of!(S_G_struct, null_immutable_string) - 10968usize];
    ["Offset of field: S_G_struct::null_immutable_vector"]
        [::core::mem::offset_of!(S_G_struct, null_immutable_vector) - 10976usize];
    ["Offset of field: S_G_struct::null_immutable_bytevector"]
        [::core::mem::offset_of!(S_G_struct, null_immutable_bytevector) - 10984usize];
    ["Offset of field: S_G_struct::zero_length_bignum"]
        [::core::mem::offset_of!(S_G_struct, zero_length_bignum) - 10992usize];
    ["Offset of field: S_G_struct::dirty_segments"]
        [::core::mem::offset_of!(S_G_struct, dirty_segments) - 11000usize];
    ["Offset of field: S_G_struct::error_id"]
        [::core::mem::offset_of!(S_G_struct, error_id) - 11224usize];
    ["Offset of field: S_G_struct::nuate_id"]
        [::core::mem::offset_of!(S_G_struct, nuate_id) - 11232usize];
    ["Offset of field: S_G_struct::null_continuation_id"]
        [::core::mem::offset_of!(S_G_struct, null_continuation_id) - 11240usize];
    ["Offset of field: S_G_struct::collect_request_pending_id"]
        [::core::mem::offset_of!(S_G_struct, collect_request_pending_id) - 11248usize];
    ["Offset of field: S_G_struct::event_and_resume_id"]
        [::core::mem::offset_of!(S_G_struct, event_and_resume_id) - 11256usize];
    ["Offset of field: S_G_struct::event_and_resume_star_id"]
        [::core::mem::offset_of!(S_G_struct, event_and_resume_star_id) - 11264usize];
    ["Offset of field: S_G_struct::guardians"]
        [::core::mem::offset_of!(S_G_struct, guardians) - 11272usize];
    ["Offset of field: S_G_struct::locked_objects"]
        [::core::mem::offset_of!(S_G_struct, locked_objects) - 11336usize];
    ["Offset of field: S_G_struct::unlocked_objects"]
        [::core::mem::offset_of!(S_G_struct, unlocked_objects) - 11400usize];
    ["Offset of field: S_G_struct::min_free_gen"]
        [::core::mem::offset_of!(S_G_struct, min_free_gen) - 11464usize];
    ["Offset of field: S_G_struct::new_min_free_gen"]
        [::core::mem::offset_of!(S_G_struct, new_min_free_gen) - 11468usize];
    ["Offset of field: S_G_struct::max_nonstatic_generation"]
        [::core::mem::offset_of!(S_G_struct, max_nonstatic_generation) - 11472usize];
    ["Offset of field: S_G_struct::new_max_nonstatic_generation"]
        [::core::mem::offset_of!(S_G_struct, new_max_nonstatic_generation) - 11476usize];
    ["Offset of field: S_G_struct::min_mark_gen"]
        [::core::mem::offset_of!(S_G_struct, min_mark_gen) - 11480usize];
    ["Offset of field: S_G_struct::countof"]
        [::core::mem::offset_of!(S_G_struct, countof) - 11488usize];
    ["Offset of field: S_G_struct::bytesof"]
        [::core::mem::offset_of!(S_G_struct, bytesof) - 13408usize];
    ["Offset of field: S_G_struct::gctimestamp"]
        [::core::mem::offset_of!(S_G_struct, gctimestamp) - 15328usize];
    ["Offset of field: S_G_struct::rtds_with_counts"]
        [::core::mem::offset_of!(S_G_struct, rtds_with_counts) - 15392usize];
    ["Offset of field: S_G_struct::countof_size"]
        [::core::mem::offset_of!(S_G_struct, countof_size) - 15456usize];
    ["Offset of field: S_G_struct::static_id"]
        [::core::mem::offset_of!(S_G_struct, static_id) - 15696usize];
    ["Offset of field: S_G_struct::countof_names"]
        [::core::mem::offset_of!(S_G_struct, countof_names) - 15704usize];
    ["Offset of field: S_G_struct::gcbackreference"]
        [::core::mem::offset_of!(S_G_struct, gcbackreference) - 15712usize];
    ["Offset of field: S_G_struct::prcgeneration"]
        [::core::mem::offset_of!(S_G_struct, prcgeneration) - 15776usize];
    ["Offset of field: S_G_struct::bytes_finalized"]
        [::core::mem::offset_of!(S_G_struct, bytes_finalized) - 15784usize];
    ["Offset of field: S_G_struct::new_dirty_cards"]
        [::core::mem::offset_of!(S_G_struct, new_dirty_cards) - 15792usize];
    ["Offset of field: S_G_struct::must_mark_gen0"]
        [::core::mem::offset_of!(S_G_struct, must_mark_gen0) - 15800usize];
    ["Offset of field: S_G_struct::oblist_length"]
        [::core::mem::offset_of!(S_G_struct, oblist_length) - 15808usize];
    ["Offset of field: S_G_struct::oblist_count"]
        [::core::mem::offset_of!(S_G_struct, oblist_count) - 15816usize];
    ["Offset of field: S_G_struct::oblist"]
        [::core::mem::offset_of!(S_G_struct, oblist) - 15824usize];
    ["Offset of field: S_G_struct::buckets_of_generation"]
        [::core::mem::offset_of!(S_G_struct, buckets_of_generation) - 15832usize];
    ["Offset of field: S_G_struct::library_entry_vector"]
        [::core::mem::offset_of!(S_G_struct, library_entry_vector) - 15888usize];
    ["Offset of field: S_G_struct::c_entry_vector"]
        [::core::mem::offset_of!(S_G_struct, c_entry_vector) - 15896usize];
    ["Offset of field: S_G_struct::base_rtd"]
        [::core::mem::offset_of!(S_G_struct, base_rtd) - 15904usize];
    ["Offset of field: S_G_struct::rtd_key"]
        [::core::mem::offset_of!(S_G_struct, rtd_key) - 15912usize];
    ["Offset of field: S_G_struct::eq_symbol"]
        [::core::mem::offset_of!(S_G_struct, eq_symbol) - 15920usize];
    ["Offset of field: S_G_struct::eq_ht_rtd"]
        [::core::mem::offset_of!(S_G_struct, eq_ht_rtd) - 15928usize];
    ["Offset of field: S_G_struct::symbol_symbol"]
        [::core::mem::offset_of!(S_G_struct, symbol_symbol) - 15936usize];
    ["Offset of field: S_G_struct::symbol_ht_rtd"]
        [::core::mem::offset_of!(S_G_struct, symbol_ht_rtd) - 15944usize];
    ["Offset of field: S_G_struct::eqp"][::core::mem::offset_of!(S_G_struct, eqp) - 15952usize];
    ["Offset of field: S_G_struct::eqvp"][::core::mem::offset_of!(S_G_struct, eqvp) - 15960usize];
    ["Offset of field: S_G_struct::equalp"]
        [::core::mem::offset_of!(S_G_struct, equalp) - 15968usize];
    ["Offset of field: S_G_struct::symboleqp"]
        [::core::mem::offset_of!(S_G_struct, symboleqp) - 15976usize];
    ["Offset of field: S_G_struct::c_entries"]
        [::core::mem::offset_of!(S_G_struct, c_entries) - 15984usize];
    ["Offset of field: S_G_struct::library_entries"]
        [::core::mem::offset_of!(S_G_struct, library_entries) - 15992usize];
    ["Offset of field: S_G_struct::library_entry_codes"]
        [::core::mem::offset_of!(S_G_struct, library_entry_codes) - 16000usize];
};
unsafe extern "C" {
    pub static mut S_G: S_G_struct;
}
unsafe extern "C" {
    pub fn atoi(arg1: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn atol(arg1: *const ::core::ffi::c_char) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn atoll(arg1: *const ::core::ffi::c_char) -> ::core::ffi::c_longlong;
}
unsafe extern "C" {
    pub fn atof(arg1: *const ::core::ffi::c_char) -> f64;
}
unsafe extern "C" {
    pub fn strtof(arg1: *const ::core::ffi::c_char, arg2: *mut *mut ::core::ffi::c_char) -> f32;
}
unsafe extern "C" {
    pub fn strtod(arg1: *const ::core::ffi::c_char, arg2: *mut *mut ::core::ffi::c_char) -> f64;
}
unsafe extern "C" {
    pub fn strtold(arg1: *const ::core::ffi::c_char, arg2: *mut *mut ::core::ffi::c_char) -> u128;
}
unsafe extern "C" {
    pub fn strtol(
        arg1: *const ::core::ffi::c_char,
        arg2: *mut *mut ::core::ffi::c_char,
        arg3: ::core::ffi::c_int,
    ) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn strtoul(
        arg1: *const ::core::ffi::c_char,
        arg2: *mut *mut ::core::ffi::c_char,
        arg3: ::core::ffi::c_int,
    ) -> ::core::ffi::c_ulong;
}
unsafe extern "C" {
    pub fn strtoll(
        arg1: *const ::core::ffi::c_char,
        arg2: *mut *mut ::core::ffi::c_char,
        arg3: ::core::ffi::c_int,
    ) -> ::core::ffi::c_longlong;
}
unsafe extern "C" {
    pub fn strtoull(
        arg1: *const ::core::ffi::c_char,
        arg2: *mut *mut ::core::ffi::c_char,
        arg3: ::core::ffi::c_int,
    ) -> ::core::ffi::c_ulonglong;
}
unsafe extern "C" {
    pub fn rand() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn srand(arg1: ::core::ffi::c_uint);
}
unsafe extern "C" {
    pub fn malloc(arg1: ::core::ffi::c_ulong) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn calloc(
        arg1: ::core::ffi::c_ulong,
        arg2: ::core::ffi::c_ulong,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn realloc(
        arg1: *mut ::core::ffi::c_void,
        arg2: ::core::ffi::c_ulong,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn free(arg1: *mut ::core::ffi::c_void);
}
unsafe extern "C" {
    pub fn aligned_alloc(
        arg1: ::core::ffi::c_ulong,
        arg2: ::core::ffi::c_ulong,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn abort() -> !;
}
unsafe extern "C" {
    pub fn atexit(arg1: ::core::option::Option<unsafe extern "C" fn()>) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn exit(arg1: ::core::ffi::c_int) -> !;
}
unsafe extern "C" {
    pub fn _Exit(arg1: ::core::ffi::c_int) -> !;
}
unsafe extern "C" {
    pub fn at_quick_exit(
        arg1: ::core::option::Option<unsafe extern "C" fn()>,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn quick_exit(arg1: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn getenv(arg1: *const ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn system(arg1: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn bsearch(
        arg1: *const ::core::ffi::c_void,
        arg2: *const ::core::ffi::c_void,
        arg3: usize,
        arg4: usize,
        arg5: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *const ::core::ffi::c_void,
                arg2: *const ::core::ffi::c_void,
            ) -> ::core::ffi::c_int,
        >,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn qsort(
        arg1: *mut ::core::ffi::c_void,
        arg2: usize,
        arg3: usize,
        arg4: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *const ::core::ffi::c_void,
                arg2: *const ::core::ffi::c_void,
            ) -> ::core::ffi::c_int,
        >,
    );
}
unsafe extern "C" {
    pub fn abs(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn labs(arg1: ::core::ffi::c_long) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn llabs(arg1: ::core::ffi::c_longlong) -> ::core::ffi::c_longlong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: ::core::ffi::c_int,
    pub rem: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of div_t"][::core::mem::size_of::<div_t>() - 8usize];
    ["Alignment of div_t"][::core::mem::align_of::<div_t>() - 4usize];
    ["Offset of field: div_t::quot"][::core::mem::offset_of!(div_t, quot) - 0usize];
    ["Offset of field: div_t::rem"][::core::mem::offset_of!(div_t, rem) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: ::core::ffi::c_long,
    pub rem: ::core::ffi::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ldiv_t"][::core::mem::size_of::<ldiv_t>() - 16usize];
    ["Alignment of ldiv_t"][::core::mem::align_of::<ldiv_t>() - 8usize];
    ["Offset of field: ldiv_t::quot"][::core::mem::offset_of!(ldiv_t, quot) - 0usize];
    ["Offset of field: ldiv_t::rem"][::core::mem::offset_of!(ldiv_t, rem) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::core::ffi::c_longlong,
    pub rem: ::core::ffi::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lldiv_t"][::core::mem::size_of::<lldiv_t>() - 16usize];
    ["Alignment of lldiv_t"][::core::mem::align_of::<lldiv_t>() - 8usize];
    ["Offset of field: lldiv_t::quot"][::core::mem::offset_of!(lldiv_t, quot) - 0usize];
    ["Offset of field: lldiv_t::rem"][::core::mem::offset_of!(lldiv_t, rem) - 8usize];
};
unsafe extern "C" {
    pub fn div(arg1: ::core::ffi::c_int, arg2: ::core::ffi::c_int) -> div_t;
}
unsafe extern "C" {
    pub fn ldiv(arg1: ::core::ffi::c_long, arg2: ::core::ffi::c_long) -> ldiv_t;
}
unsafe extern "C" {
    pub fn lldiv(arg1: ::core::ffi::c_longlong, arg2: ::core::ffi::c_longlong) -> lldiv_t;
}
unsafe extern "C" {
    pub fn mblen(arg1: *const ::core::ffi::c_char, arg2: usize) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn mbtowc(
        arg1: *mut wchar_t,
        arg2: *const ::core::ffi::c_char,
        arg3: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn wctomb(arg1: *mut ::core::ffi::c_char, arg2: wchar_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn mbstowcs(arg1: *mut wchar_t, arg2: *const ::core::ffi::c_char, arg3: usize) -> usize;
}
unsafe extern "C" {
    pub fn wcstombs(arg1: *mut ::core::ffi::c_char, arg2: *const wchar_t, arg3: usize) -> usize;
}
unsafe extern "C" {
    pub fn __ctype_get_mb_cur_max() -> usize;
}
unsafe extern "C" {
    pub fn posix_memalign(
        arg1: *mut *mut ::core::ffi::c_void,
        arg2: usize,
        arg3: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn setenv(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn unsetenv(arg1: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn mkstemp(arg1: *mut ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn mkostemp(arg1: *mut ::core::ffi::c_char, arg2: ::core::ffi::c_int)
        -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn mkdtemp(arg1: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn getsubopt(
        arg1: *mut *mut ::core::ffi::c_char,
        arg2: *const *mut ::core::ffi::c_char,
        arg3: *mut *mut ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn rand_r(arg1: *mut ::core::ffi::c_uint) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn realpath(
        arg1: *const ::core::ffi::c_char,
        arg2: *mut ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn random() -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn srandom(arg1: ::core::ffi::c_uint);
}
unsafe extern "C" {
    pub fn initstate(
        arg1: ::core::ffi::c_uint,
        arg2: *mut ::core::ffi::c_char,
        arg3: usize,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn setstate(arg1: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn putenv(arg1: *mut ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn posix_openpt(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn grantpt(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn unlockpt(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ptsname(arg1: ::core::ffi::c_int) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn l64a(arg1: ::core::ffi::c_long) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn a64l(arg1: *const ::core::ffi::c_char) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn setkey(arg1: *const ::core::ffi::c_char);
}
unsafe extern "C" {
    pub fn drand48() -> f64;
}
unsafe extern "C" {
    pub fn erand48(arg1: *mut ::core::ffi::c_ushort) -> f64;
}
unsafe extern "C" {
    pub fn lrand48() -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn nrand48(arg1: *mut ::core::ffi::c_ushort) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn mrand48() -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn jrand48(arg1: *mut ::core::ffi::c_ushort) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn srand48(arg1: ::core::ffi::c_long);
}
unsafe extern "C" {
    pub fn seed48(arg1: *mut ::core::ffi::c_ushort) -> *mut ::core::ffi::c_ushort;
}
unsafe extern "C" {
    pub fn lcong48(arg1: *mut ::core::ffi::c_ushort);
}
unsafe extern "C" {
    pub fn alloca(arg1: ::core::ffi::c_ulong) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mktemp(arg1: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn mkstemps(arg1: *mut ::core::ffi::c_char, arg2: ::core::ffi::c_int)
        -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn mkostemps(
        arg1: *mut ::core::ffi::c_char,
        arg2: ::core::ffi::c_int,
        arg3: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn valloc(arg1: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn memalign(
        arg1: ::core::ffi::c_ulong,
        arg2: ::core::ffi::c_ulong,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn getloadavg(arg1: *mut f64, arg2: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn clearenv() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn reallocarray(
        arg1: *mut ::core::ffi::c_void,
        arg2: usize,
        arg3: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn qsort_r(
        arg1: *mut ::core::ffi::c_void,
        arg2: usize,
        arg3: usize,
        arg4: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *const ::core::ffi::c_void,
                arg2: *const ::core::ffi::c_void,
                arg3: *mut ::core::ffi::c_void,
            ) -> ::core::ffi::c_int,
        >,
        arg5: *mut ::core::ffi::c_void,
    );
}
unsafe extern "C" {
    pub fn memcpy(
        arg1: *mut ::core::ffi::c_void,
        arg2: *const ::core::ffi::c_void,
        arg3: ::core::ffi::c_ulong,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn memmove(
        arg1: *mut ::core::ffi::c_void,
        arg2: *const ::core::ffi::c_void,
        arg3: ::core::ffi::c_ulong,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn memset(
        arg1: *mut ::core::ffi::c_void,
        arg2: ::core::ffi::c_int,
        arg3: ::core::ffi::c_ulong,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn memcmp(
        arg1: *const ::core::ffi::c_void,
        arg2: *const ::core::ffi::c_void,
        arg3: ::core::ffi::c_ulong,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn memchr(
        arg1: *const ::core::ffi::c_void,
        arg2: ::core::ffi::c_int,
        arg3: ::core::ffi::c_ulong,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn strcpy(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strncpy(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_ulong,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strcat(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strncat(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_ulong,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strcmp(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn strncmp(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_ulong,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn strcoll(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn strxfrm(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_ulong,
    ) -> ::core::ffi::c_ulong;
}
unsafe extern "C" {
    pub fn strchr(
        arg1: *const ::core::ffi::c_char,
        arg2: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strrchr(
        arg1: *const ::core::ffi::c_char,
        arg2: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strcspn(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_ulong;
}
unsafe extern "C" {
    pub fn strspn(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_ulong;
}
unsafe extern "C" {
    pub fn strpbrk(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strstr(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strtok(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strlen(arg1: *const ::core::ffi::c_char) -> ::core::ffi::c_ulong;
}
unsafe extern "C" {
    pub fn strerror(arg1: ::core::ffi::c_int) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn bcmp(
        arg1: *const ::core::ffi::c_void,
        arg2: *const ::core::ffi::c_void,
        arg3: ::core::ffi::c_ulong,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn bcopy(
        arg1: *const ::core::ffi::c_void,
        arg2: *mut ::core::ffi::c_void,
        arg3: ::core::ffi::c_ulong,
    );
}
unsafe extern "C" {
    pub fn bzero(arg1: *mut ::core::ffi::c_void, arg2: ::core::ffi::c_ulong);
}
unsafe extern "C" {
    pub fn index(
        arg1: *const ::core::ffi::c_char,
        arg2: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn rindex(
        arg1: *const ::core::ffi::c_char,
        arg2: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn ffs(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ffsl(arg1: ::core::ffi::c_long) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ffsll(arg1: ::core::ffi::c_longlong) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn strcasecmp(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn strncasecmp(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_ulong,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn strcasecmp_l(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: locale_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn strncasecmp_l(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: usize,
        arg4: locale_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn strtok_r(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: *mut *mut ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strerror_r(
        arg1: ::core::ffi::c_int,
        arg2: *mut ::core::ffi::c_char,
        arg3: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn stpcpy(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn stpncpy(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_ulong,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strnlen(arg1: *const ::core::ffi::c_char, arg2: usize) -> usize;
}
unsafe extern "C" {
    pub fn strdup(arg1: *const ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strndup(
        arg1: *const ::core::ffi::c_char,
        arg2: ::core::ffi::c_ulong,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strsignal(arg1: ::core::ffi::c_int) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strerror_l(arg1: ::core::ffi::c_int, arg2: locale_t) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strcoll_l(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: locale_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn strxfrm_l(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: usize,
        arg4: locale_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn memmem(
        arg1: *const ::core::ffi::c_void,
        arg2: usize,
        arg3: *const ::core::ffi::c_void,
        arg4: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn memccpy(
        arg1: *mut ::core::ffi::c_void,
        arg2: *const ::core::ffi::c_void,
        arg3: ::core::ffi::c_int,
        arg4: ::core::ffi::c_ulong,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn strsep(
        arg1: *mut *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strlcat(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_ulong,
    ) -> ::core::ffi::c_ulong;
}
unsafe extern "C" {
    pub fn strlcpy(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_ulong,
    ) -> ::core::ffi::c_ulong;
}
unsafe extern "C" {
    pub fn explicit_bzero(arg1: *mut ::core::ffi::c_void, arg2: usize);
}
unsafe extern "C" {
    pub fn __errno_location() -> *mut ::core::ffi::c_int;
}
pub type uid_t = ::core::ffi::c_uint;
pub type gid_t = ::core::ffi::c_uint;
pub type useconds_t = ::core::ffi::c_uint;
unsafe extern "C" {
    pub fn pipe(arg1: *mut ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pipe2(arg1: *mut ::core::ffi::c_int, arg2: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn close(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn posix_close(arg1: ::core::ffi::c_int, arg2: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn dup(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn dup2(arg1: ::core::ffi::c_int, arg2: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn dup3(
        arg1: ::core::ffi::c_int,
        arg2: ::core::ffi::c_int,
        arg3: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn lseek(arg1: ::core::ffi::c_int, arg2: off_t, arg3: ::core::ffi::c_int) -> off_t;
}
unsafe extern "C" {
    pub fn fsync(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fdatasync(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn read(arg1: ::core::ffi::c_int, arg2: *mut ::core::ffi::c_void, arg3: usize) -> isize;
}
unsafe extern "C" {
    pub fn write(arg1: ::core::ffi::c_int, arg2: *const ::core::ffi::c_void, arg3: usize) -> isize;
}
unsafe extern "C" {
    pub fn pread(
        arg1: ::core::ffi::c_int,
        arg2: *mut ::core::ffi::c_void,
        arg3: usize,
        arg4: off_t,
    ) -> isize;
}
unsafe extern "C" {
    pub fn pwrite(
        arg1: ::core::ffi::c_int,
        arg2: *const ::core::ffi::c_void,
        arg3: usize,
        arg4: off_t,
    ) -> isize;
}
unsafe extern "C" {
    pub fn chown(arg1: *const ::core::ffi::c_char, arg2: uid_t, arg3: gid_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fchown(arg1: ::core::ffi::c_int, arg2: uid_t, arg3: gid_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn lchown(arg1: *const ::core::ffi::c_char, arg2: uid_t, arg3: gid_t)
        -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fchownat(
        arg1: ::core::ffi::c_int,
        arg2: *const ::core::ffi::c_char,
        arg3: uid_t,
        arg4: gid_t,
        arg5: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn link(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn linkat(
        arg1: ::core::ffi::c_int,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_int,
        arg4: *const ::core::ffi::c_char,
        arg5: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn symlink(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn symlinkat(
        arg1: *const ::core::ffi::c_char,
        arg2: ::core::ffi::c_int,
        arg3: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn readlink(
        arg1: *const ::core::ffi::c_char,
        arg2: *mut ::core::ffi::c_char,
        arg3: usize,
    ) -> isize;
}
unsafe extern "C" {
    pub fn readlinkat(
        arg1: ::core::ffi::c_int,
        arg2: *const ::core::ffi::c_char,
        arg3: *mut ::core::ffi::c_char,
        arg4: usize,
    ) -> isize;
}
unsafe extern "C" {
    pub fn unlink(arg1: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn unlinkat(
        arg1: ::core::ffi::c_int,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn rmdir(arg1: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn truncate(arg1: *const ::core::ffi::c_char, arg2: off_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ftruncate(arg1: ::core::ffi::c_int, arg2: off_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn access(arg1: *const ::core::ffi::c_char, arg2: ::core::ffi::c_int)
        -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn faccessat(
        arg1: ::core::ffi::c_int,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_int,
        arg4: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn chdir(arg1: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fchdir(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn getcwd(arg1: *mut ::core::ffi::c_char, arg2: usize) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn alarm(arg1: ::core::ffi::c_uint) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    pub fn sleep(arg1: ::core::ffi::c_uint) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    pub fn pause() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fork() -> pid_t;
}
unsafe extern "C" {
    pub fn _Fork() -> pid_t;
}
unsafe extern "C" {
    pub fn execve(
        arg1: *const ::core::ffi::c_char,
        arg2: *const *mut ::core::ffi::c_char,
        arg3: *const *mut ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn execv(
        arg1: *const ::core::ffi::c_char,
        arg2: *const *mut ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn execle(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn execl(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn execvp(
        arg1: *const ::core::ffi::c_char,
        arg2: *const *mut ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn execlp(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fexecve(
        arg1: ::core::ffi::c_int,
        arg2: *const *mut ::core::ffi::c_char,
        arg3: *const *mut ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _exit(arg1: ::core::ffi::c_int) -> !;
}
unsafe extern "C" {
    pub fn getpid() -> pid_t;
}
unsafe extern "C" {
    pub fn getppid() -> pid_t;
}
unsafe extern "C" {
    pub fn getpgrp() -> pid_t;
}
unsafe extern "C" {
    pub fn getpgid(arg1: pid_t) -> pid_t;
}
unsafe extern "C" {
    pub fn setpgid(arg1: pid_t, arg2: pid_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn setsid() -> pid_t;
}
unsafe extern "C" {
    pub fn getsid(arg1: pid_t) -> pid_t;
}
unsafe extern "C" {
    pub fn ttyname(arg1: ::core::ffi::c_int) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn ttyname_r(
        arg1: ::core::ffi::c_int,
        arg2: *mut ::core::ffi::c_char,
        arg3: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn isatty(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn tcgetpgrp(arg1: ::core::ffi::c_int) -> pid_t;
}
unsafe extern "C" {
    pub fn tcsetpgrp(arg1: ::core::ffi::c_int, arg2: pid_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn getuid() -> uid_t;
}
unsafe extern "C" {
    pub fn geteuid() -> uid_t;
}
unsafe extern "C" {
    pub fn getgid() -> gid_t;
}
unsafe extern "C" {
    pub fn getegid() -> gid_t;
}
unsafe extern "C" {
    pub fn getgroups(arg1: ::core::ffi::c_int, arg2: *mut gid_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn setuid(arg1: uid_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn seteuid(arg1: uid_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn setgid(arg1: gid_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn setegid(arg1: gid_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn getlogin() -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn getlogin_r(arg1: *mut ::core::ffi::c_char, arg2: usize) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn gethostname(arg1: *mut ::core::ffi::c_char, arg2: usize) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn getopt(
        arg1: ::core::ffi::c_int,
        arg2: *const *mut ::core::ffi::c_char,
        arg3: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub static mut optarg: *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub static mut optind: ::core::ffi::c_int;
}
unsafe extern "C" {
    pub static mut opterr: ::core::ffi::c_int;
}
unsafe extern "C" {
    pub static mut optopt: ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pathconf(
        arg1: *const ::core::ffi::c_char,
        arg2: ::core::ffi::c_int,
    ) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn fpathconf(arg1: ::core::ffi::c_int, arg2: ::core::ffi::c_int) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn sysconf(arg1: ::core::ffi::c_int) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn confstr(arg1: ::core::ffi::c_int, arg2: *mut ::core::ffi::c_char, arg3: usize) -> usize;
}
unsafe extern "C" {
    pub fn setreuid(arg1: uid_t, arg2: uid_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn setregid(arg1: gid_t, arg2: gid_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn lockf(
        arg1: ::core::ffi::c_int,
        arg2: ::core::ffi::c_int,
        arg3: off_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn gethostid() -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn nice(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sync();
}
unsafe extern "C" {
    pub fn setpgrp() -> pid_t;
}
unsafe extern "C" {
    pub fn crypt(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn encrypt(arg1: *mut ::core::ffi::c_char, arg2: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn swab(arg1: *const ::core::ffi::c_void, arg2: *mut ::core::ffi::c_void, arg3: isize);
}
unsafe extern "C" {
    pub fn usleep(arg1: ::core::ffi::c_uint) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ualarm(arg1: ::core::ffi::c_uint, arg2: ::core::ffi::c_uint) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    pub fn brk(arg1: *mut ::core::ffi::c_void) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sbrk(arg1: isize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn vfork() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn vhangup() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn chroot(arg1: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn getpagesize() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn getdtablesize() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sethostname(arg1: *const ::core::ffi::c_char, arg2: usize) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn getdomainname(arg1: *mut ::core::ffi::c_char, arg2: usize) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn setdomainname(arg1: *const ::core::ffi::c_char, arg2: usize) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn setgroups(arg1: usize, arg2: *const gid_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn getpass(arg1: *const ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn daemon(arg1: ::core::ffi::c_int, arg2: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn setusershell();
}
unsafe extern "C" {
    pub fn endusershell();
}
unsafe extern "C" {
    pub fn getusershell() -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn acct(arg1: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn syscall(arg1: ::core::ffi::c_long, ...) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn execvpe(
        arg1: *const ::core::ffi::c_char,
        arg2: *const *mut ::core::ffi::c_char,
        arg3: *const *mut ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn issetugid() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn getentropy(arg1: *mut ::core::ffi::c_void, arg2: usize) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub static mut optreset: ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn S_alloc_init();
}
unsafe extern "C" {
    pub fn S_protect(p: *mut ptr);
}
unsafe extern "C" {
    pub fn S_reset_scheme_stack(tc: ptr, n: iptr);
}
unsafe extern "C" {
    pub fn S_reset_allocation_pointer(tc: ptr);
}
unsafe extern "C" {
    pub fn S_maybe_fire_collector(tgc: *mut thread_gc);
}
unsafe extern "C" {
    pub fn S_compute_bytes_allocated(xg: ptr, xs: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_bytes_finalized() -> ptr;
}
unsafe extern "C" {
    pub fn S_find_more_room(s: ISPC, g: IGEN, n: iptr, old: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_record_new_dirty_card(tgc: *mut thread_gc, ppp: *mut ptr, to_g: IGEN);
}
unsafe extern "C" {
    pub fn S_find_more_gc_room(tgc: *mut thread_gc, g: IGEN, s: ISPC, n: iptr, old: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_close_off_thread_local_segment(tc: ptr, s: ISPC, g: IGEN);
}
unsafe extern "C" {
    pub fn S_dirty_set(loc: *mut ptr, x: ptr);
}
unsafe extern "C" {
    pub fn S_mark_card_dirty(card: uptr, to_g: IGEN);
}
unsafe extern "C" {
    pub fn S_scan_dirty(p: *mut ptr, endp: *mut ptr);
}
unsafe extern "C" {
    pub fn S_scan_remembered_set();
}
unsafe extern "C" {
    pub fn S_get_more_room();
}
unsafe extern "C" {
    pub fn S_get_more_room_help(tc: ptr, ap: uptr, type_: uptr, size: uptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_list_bits_ref(p: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_list_bits_set(p: ptr, bits: iptr);
}
unsafe extern "C" {
    pub fn S_cons_in(tc: ptr, s: ISPC, g: IGEN, car: ptr, cdr: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_ephemeron_cons_in(g: IGEN, car: ptr, cdr: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_symbol(name: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_rational(n: ptr, d: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_tlc(keyval: ptr, tconc: ptr, next: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_vector_in(tc: ptr, s: ISPC, g: IGEN, n: iptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_vector(n: iptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_fxvector(n: iptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_flvector(n: iptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_bytevector(n: iptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_bytevector2(tc: ptr, n: iptr, spc: ISPC) -> ptr;
}
unsafe extern "C" {
    pub fn S_null_immutable_vector() -> ptr;
}
unsafe extern "C" {
    pub fn S_null_immutable_fxvector() -> ptr;
}
unsafe extern "C" {
    pub fn S_null_immutable_bytevector() -> ptr;
}
unsafe extern "C" {
    pub fn S_null_immutable_string() -> ptr;
}
unsafe extern "C" {
    pub fn S_stencil_vector(mask: uptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_system_stencil_vector(mask: uptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_record(n: iptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_closure(cod: ptr, n: iptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_mkcontinuation(
        s: ISPC,
        g: IGEN,
        nuate: ptr,
        stack: ptr,
        length: iptr,
        clength: iptr,
        link: ptr,
        ret: ptr,
        winders: ptr,
        attachments: ptr,
    ) -> ptr;
}
unsafe extern "C" {
    pub fn S_inexactnum(rp: f64, ip: f64) -> ptr;
}
unsafe extern "C" {
    pub fn S_exactnum(a: ptr, b: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_thread(tc: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_string(s: *const ::core::ffi::c_char, n: iptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_bignum(tc: ptr, n: iptr, sign: IBOOL) -> ptr;
}
unsafe extern "C" {
    pub fn S_code(tc: ptr, type_: iptr, n: iptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_relocation_table(n: iptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_weak_cons(car: ptr, cdr: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_box2(ref_: ptr, immobile: IBOOL) -> ptr;
}
unsafe extern "C" {
    pub fn S_phantom_bytevector(sz: uptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_phantom_bytevector_adjust(ph: ptr, new_sz: uptr);
}
unsafe extern "C" {
    pub fn S_fasl_init();
}
unsafe extern "C" {
    pub fn S_fasl_read(fd: INT, situation: IFASLCODE, path: ptr, externals: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_bv_fasl_read(
        bv: ptr,
        ty: ::core::ffi::c_int,
        offset: uptr,
        len: uptr,
        path: ptr,
        externals: ptr,
    ) -> ptr;
}
unsafe extern "C" {
    pub fn S_boot_read(f: faslFile, path: *const ::core::ffi::c_char) -> ptr;
}
unsafe extern "C" {
    pub fn S_format_scheme_version(n: uptr) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn S_lookup_machine_type(n: uptr) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn S_set_code_obj(
        who: *mut ::core::ffi::c_char,
        typ: IFASLCODE,
        p: ptr,
        n: iptr,
        x: ptr,
        o: iptr,
    );
}
unsafe extern "C" {
    pub fn S_get_code_obj(typ: IFASLCODE, p: ptr, n: iptr, o: iptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_fasl_intern_rtd(x: *mut ptr) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn S_fasl_init_fd(
        ffo: fileFaslFile,
        path: ptr,
        fd: INT,
        buffer_mode: ::core::ffi::c_int,
        size: uptr,
    );
}
unsafe extern "C" {
    pub fn S_fasl_init_bytes(ffo: faslFile, path: ptr, data: *mut ::core::ffi::c_void, len: iptr);
}
unsafe extern "C" {
    pub fn S_fasl_init_bv(ffo: faslFile, path: ptr, bv: ptr);
}
unsafe extern "C" {
    pub fn S_fasl_bytein(f: faslFile) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn S_fasl_uptrin(f: faslFile, bytes_consumed: *mut INT) -> uptr;
}
unsafe extern "C" {
    pub fn S_fasl_bytesin(s: *mut octet, n: iptr, f: faslFile);
}
unsafe extern "C" {
    pub fn S_vfasl(bv: ptr, stream: faslFile, offset: iptr, len: iptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_vfasl_to(v: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_record_code_mod(tc: ptr, addr: uptr, bytes: uptr);
}
unsafe extern "C" {
    pub fn S_flush_instruction_cache(tc: ptr);
}
unsafe extern "C" {
    pub fn S_flushcache_init();
}
unsafe extern "C" {
    pub fn S_foreign_init();
}
unsafe extern "C" {
    pub fn S_foreign_entry();
}
unsafe extern "C" {
    pub fn S_ptr_tell(p: ptr);
}
unsafe extern "C" {
    pub fn S_addr_tell(p: ptr);
}
unsafe extern "C" {
    pub fn S_gc_init();
}
unsafe extern "C" {
    pub fn S_register_child_process(child: INT);
}
unsafe extern "C" {
    pub fn S_fixup_counts(counts: ptr);
}
unsafe extern "C" {
    pub fn S_do_gc(max_cg: IGEN, min_tg: IGEN, max_tg: IGEN, count_roots: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_gc(tc: ptr, max_cg: IGEN, min_tg: IGEN, max_tg: IGEN, count_roots: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_set_maxgen(g: IGEN);
}
unsafe extern "C" {
    pub fn S_maxgen() -> IGEN;
}
unsafe extern "C" {
    pub fn S_set_minfreegen(g: IGEN);
}
unsafe extern "C" {
    pub fn S_minfreegen() -> IGEN;
}
unsafe extern "C" {
    pub fn S_set_minmarkgen(g: IGEN);
}
unsafe extern "C" {
    pub fn S_minmarkgen() -> IGEN;
}
unsafe extern "C" {
    pub fn S_enable_object_counts() -> IBOOL;
}
unsafe extern "C" {
    pub fn S_set_enable_object_counts(eoc: IBOOL);
}
unsafe extern "C" {
    pub fn S_object_counts() -> ptr;
}
unsafe extern "C" {
    pub fn S_enable_object_backreferences() -> IBOOL;
}
unsafe extern "C" {
    pub fn S_set_enable_object_backreferences(eoc: IBOOL);
}
unsafe extern "C" {
    pub fn S_object_backreferences() -> ptr;
}
unsafe extern "C" {
    pub fn S_immobilize_object(v: ptr);
}
unsafe extern "C" {
    pub fn S_mobilize_object(v: ptr);
}
unsafe extern "C" {
    pub fn S_locked_objects() -> ptr;
}
unsafe extern "C" {
    pub fn S_unregister_guardian(tconc: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_compact_heap();
}
unsafe extern "C" {
    pub fn S_check_heap(aftergc: IBOOL, target_gen: IGEN);
}
unsafe extern "C" {
    pub fn S_gc_011(tc: ptr);
}
unsafe extern "C" {
    pub fn S_gc_par(tc: ptr, max_cg: IGEN, min_tg: IGEN, max_tg: IGEN, count_roots: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_gc_ocd(tc: ptr, max_cg: IGEN, min_tg: IGEN, max_tg: IGEN, count_roots: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_gc_oce(tc: ptr, max_cg: IGEN, min_tg: IGEN, max_tg: IGEN, count_roots: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_count_size_increments(ls: ptr, generation: IGEN) -> ptr;
}
unsafe extern "C" {
    pub fn S_intern_init();
}
unsafe extern "C" {
    pub fn S_resize_oblist();
}
unsafe extern "C" {
    pub fn S_intern(s: *const ::core::ffi::c_uchar) -> ptr;
}
unsafe extern "C" {
    pub fn S_intern_sc(s: *const string_char, n: iptr, name_str: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_intern3(
        pname: *const string_char,
        plen: iptr,
        uname: *const string_char,
        ulen: iptr,
        pname_str: ptr,
        uame_str: ptr,
    ) -> ptr;
}
unsafe extern "C" {
    pub fn S_intern4(sym: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_intern_gensym(sym: ptr, sym_name: ptr);
}
unsafe extern "C" {
    pub fn S_retrofit_nonprocedure_code();
}
unsafe extern "C" {
    pub fn S_mkstring(s: *const string_char, n: iptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_symbol_hash32(str_: ptr) -> I32;
}
unsafe extern "C" {
    pub fn S_symbol_hash64(str_: ptr) -> I64;
}
unsafe extern "C" {
    pub fn S_file_existsp(inpath: *const ::core::ffi::c_char, followp: IBOOL) -> IBOOL;
}
unsafe extern "C" {
    pub fn S_file_regularp(inpath: *const ::core::ffi::c_char, followp: IBOOL) -> IBOOL;
}
unsafe extern "C" {
    pub fn S_file_directoryp(inpath: *const ::core::ffi::c_char, followp: IBOOL) -> IBOOL;
}
unsafe extern "C" {
    pub fn S_file_symbolic_linkp(inpath: *const ::core::ffi::c_char) -> IBOOL;
}
unsafe extern "C" {
    pub fn S_directory_list(inpath: *const ::core::ffi::c_char) -> ptr;
}
unsafe extern "C" {
    pub fn S_malloc_pathname(inpath: *const ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn S_fixedpathp(inpath: *const ::core::ffi::c_char) -> IBOOL;
}
unsafe extern "C" {
    pub fn S_zlib_compress_level(compress_level: INT) -> INT;
}
unsafe extern "C" {
    pub fn S_lz4_compress_level(compress_level: INT) -> INT;
}
unsafe extern "C" {
    pub fn S_glzdopen_output(fd: INT, compress_format: INT, compress_level: INT) -> glzFile;
}
unsafe extern "C" {
    pub fn S_glzdopen_input(fd: INT) -> glzFile;
}
unsafe extern "C" {
    pub fn S_glzopen_input(path: *const ::core::ffi::c_char) -> glzFile;
}
unsafe extern "C" {
    pub fn S_glzdirect(file: glzFile) -> IBOOL;
}
unsafe extern "C" {
    pub fn S_glzclose(file: glzFile) -> INT;
}
unsafe extern "C" {
    pub fn S_glzread(file: glzFile, buffer: *mut ::core::ffi::c_void, count: UINT) -> INT;
}
unsafe extern "C" {
    pub fn S_glzwrite(file: glzFile, buffer: *mut ::core::ffi::c_void, count: UINT) -> INT;
}
unsafe extern "C" {
    pub fn S_glzseek(
        file: glzFile,
        offset: ::core::ffi::c_long,
        whence: INT,
    ) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn S_glzgetc(file: glzFile) -> INT;
}
unsafe extern "C" {
    pub fn S_glzungetc(c: INT, file: glzFile) -> INT;
}
unsafe extern "C" {
    pub fn S_glzrewind(file: glzFile) -> INT;
}
unsafe extern "C" {
    pub fn S_glzerror(file: glzFile, errnum: *mut INT);
}
unsafe extern "C" {
    pub fn S_glzclearerr(fdfile: glzFile);
}
unsafe extern "C" {
    pub fn S_gzxfile_fd(x: ptr) -> INT;
}
unsafe extern "C" {
    pub fn S_gzxfile_gzfile(x: ptr) -> glzFile;
}
unsafe extern "C" {
    pub fn S_new_open_input_fd(filename: *const ::core::ffi::c_char, compressed: IBOOL) -> ptr;
}
unsafe extern "C" {
    pub fn S_new_open_output_fd(
        filename: *const ::core::ffi::c_char,
        mode: INT,
        options: INT,
    ) -> ptr;
}
unsafe extern "C" {
    pub fn S_new_open_input_output_fd(
        filename: *const ::core::ffi::c_char,
        mode: INT,
        options: INT,
    ) -> ptr;
}
unsafe extern "C" {
    pub fn S_close_fd(file: ptr, gzflag: IBOOL) -> ptr;
}
unsafe extern "C" {
    pub fn S_compress_input_fd(fd: INT, fp: I64) -> ptr;
}
unsafe extern "C" {
    pub fn S_compress_output_fd(fd: INT) -> ptr;
}
unsafe extern "C" {
    pub fn S_bytevector_read(
        file: ptr,
        buffer: ptr,
        start: iptr,
        count: iptr,
        gzflag: IBOOL,
    ) -> ptr;
}
unsafe extern "C" {
    pub fn S_bytevector_read_nb(
        file: ptr,
        buffer: ptr,
        start: iptr,
        count: iptr,
        gzflag: IBOOL,
    ) -> ptr;
}
unsafe extern "C" {
    pub fn S_bytevector_write(
        file: ptr,
        buffer: ptr,
        start: iptr,
        count: iptr,
        gzflag: IBOOL,
    ) -> ptr;
}
unsafe extern "C" {
    pub fn S_put_byte(file: ptr, byte: INT, gzflag: IBOOL) -> ptr;
}
unsafe extern "C" {
    pub fn S_get_fd_pos(file: ptr, gzflag: IBOOL) -> ptr;
}
unsafe extern "C" {
    pub fn S_set_fd_pos(file: ptr, pos: ptr, gzflag: IBOOL) -> ptr;
}
unsafe extern "C" {
    pub fn S_get_fd_non_blocking(file: ptr, gzflag: IBOOL) -> ptr;
}
unsafe extern "C" {
    pub fn S_set_fd_non_blocking(file: ptr, x: IBOOL, gzflag: IBOOL) -> ptr;
}
unsafe extern "C" {
    pub fn S_get_fd_length(file: ptr, gzflag: IBOOL) -> ptr;
}
unsafe extern "C" {
    pub fn S_set_fd_length(file: ptr, length: ptr, gzflag: IBOOL) -> ptr;
}
unsafe extern "C" {
    pub fn S_new_io_init();
}
unsafe extern "C" {
    pub fn S_bytevector_compress_size(s_count: iptr, compress_format: INT) -> uptr;
}
unsafe extern "C" {
    pub fn S_bytevector_compress(
        dest_bv: ptr,
        d_start: iptr,
        d_count: iptr,
        src_bv: ptr,
        s_start: iptr,
        s_count: iptr,
        compress_format: INT,
    ) -> ptr;
}
unsafe extern "C" {
    pub fn S_bytevector_uncompress(
        dest_bv: ptr,
        d_start: iptr,
        d_count: iptr,
        src_bv: ptr,
        s_start: iptr,
        s_count: iptr,
        compress_format: INT,
    ) -> ptr;
}
unsafe extern "C" {
    pub fn S_thread_init();
}
unsafe extern "C" {
    pub fn S_create_thread_object(who: *const ::core::ffi::c_char, p_tc: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_fork_thread(thunk: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_make_mutex() -> ptr;
}
unsafe extern "C" {
    pub fn S_mutex_free(m: *mut scheme_mutex_t);
}
unsafe extern "C" {
    pub fn S_mutex_acquire(m: *mut scheme_mutex_t);
}
unsafe extern "C" {
    pub fn S_mutex_tryacquire(m: *mut scheme_mutex_t) -> INT;
}
unsafe extern "C" {
    pub fn S_mutex_release(m: *mut scheme_mutex_t);
}
unsafe extern "C" {
    pub fn S_mutex_is_owner(m: *mut scheme_mutex_t) -> IBOOL;
}
unsafe extern "C" {
    pub fn S_make_condition() -> *mut s_thread_cond_t;
}
unsafe extern "C" {
    pub fn S_condition_free(c: *mut s_thread_cond_t);
}
unsafe extern "C" {
    pub fn S_condition_wait(c: *mut s_thread_cond_t, m: *mut scheme_mutex_t, t: ptr) -> IBOOL;
}
unsafe extern "C" {
    pub fn S_activate_thread() -> INT;
}
unsafe extern "C" {
    pub fn S_unactivate_thread(mode: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn S_generic_invoke(tc: ptr, code: ptr);
}
unsafe extern "C" {
    pub fn S_number_init();
}
unsafe extern "C" {
    pub fn S_normalize_bignum(x: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_integer_value(who: *const ::core::ffi::c_char, x: ptr) -> iptr;
}
unsafe extern "C" {
    pub fn S_int64_value(who: *mut ::core::ffi::c_char, x: ptr) -> I64;
}
unsafe extern "C" {
    pub fn S_big_eq(x: ptr, y: ptr) -> IBOOL;
}
unsafe extern "C" {
    pub fn S_big_lt(x: ptr, y: ptr) -> IBOOL;
}
unsafe extern "C" {
    pub fn S_big_negate(x: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_add(x: ptr, y: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_sub(x: ptr, y: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_mul(x: ptr, y: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_div(x: ptr, y: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_rem(x: ptr, y: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_trunc(x: ptr, y: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_trunc_rem(tc: ptr, x: ptr, y: ptr, q: *mut ptr, r: *mut ptr);
}
unsafe extern "C" {
    pub fn S_gcd(x: ptr, y: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_ash(x: ptr, n: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_big_positive_bit_field(x: ptr, fxstart: ptr, fxend: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_integer_length(x: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_big_trailing_zero_bits(x: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_big_first_bit_set(x: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_random_double(m1: U32, m2: U32, m3: U32, m4: U32, scale: f64) -> f64;
}
unsafe extern "C" {
    pub fn S_floatify(x: ptr) -> f64;
}
unsafe extern "C" {
    pub fn S_decode_float(d: f64) -> ptr;
}
unsafe extern "C" {
    pub fn S_logand(x: ptr, y: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_logbitp(k: ptr, x: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_logbit0(k: ptr, x: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_logbit1(k: ptr, x: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_logtest(x: ptr, y: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_logor(x: ptr, y: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_logxor(x: ptr, y: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_lognot(x: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_bignum_mask_test();
}
unsafe extern "C" {
    pub fn S_lookup_library_entry(n: iptr, errorp: IBOOL) -> ptr;
}
unsafe extern "C" {
    pub fn S_lookup_c_entry(i: iptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_prim_init();
}
unsafe extern "C" {
    pub fn S_install_c_entry(i: iptr, x: ptr);
}
unsafe extern "C" {
    pub fn S_check_c_entry_vector();
}
unsafe extern "C" {
    pub fn S_strerror(errnum: INT) -> ptr;
}
unsafe extern "C" {
    pub fn S_prim5_init();
}
unsafe extern "C" {
    pub fn S_dump_tc(tc: ptr);
}
unsafe extern "C" {
    pub fn S_uninterned(x: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_print_init();
}
unsafe extern "C" {
    pub fn S_prin1(x: ptr);
}
unsafe extern "C" {
    pub fn S_get_scheme_arg(tc: ptr, n: iptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_put_scheme_arg(tc: ptr, n: iptr, x: ptr);
}
unsafe extern "C" {
    pub fn S_continuation_depth(k: ptr) -> iptr;
}
unsafe extern "C" {
    pub fn S_single_continuation(k: ptr, n: iptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_promote_to_multishot(k: ptr);
}
unsafe extern "C" {
    pub fn S_split_and_resize();
}
unsafe extern "C" {
    pub fn S_handle_overflow();
}
unsafe extern "C" {
    pub fn S_handle_overflood();
}
unsafe extern "C" {
    pub fn S_handle_apply_overflood();
}
unsafe extern "C" {
    pub fn S_overflow(tc: ptr, frame_request: iptr);
}
unsafe extern "C" {
    pub fn S_error_reset(s: *const ::core::ffi::c_char) -> !;
}
unsafe extern "C" {
    pub fn S_error_abort(s: *const ::core::ffi::c_char) -> !;
}
unsafe extern "C" {
    pub fn S_abnormal_exit() -> !;
}
unsafe extern "C" {
    pub fn S_error(who: *const ::core::ffi::c_char, s: *const ::core::ffi::c_char) -> !;
}
unsafe extern "C" {
    pub fn S_error1(who: *const ::core::ffi::c_char, s: *const ::core::ffi::c_char, x: ptr) -> !;
}
unsafe extern "C" {
    pub fn S_error2(
        who: *const ::core::ffi::c_char,
        s: *const ::core::ffi::c_char,
        x: ptr,
        y: ptr,
    ) -> !;
}
unsafe extern "C" {
    pub fn S_error3(
        who: *const ::core::ffi::c_char,
        s: *const ::core::ffi::c_char,
        x: ptr,
        y: ptr,
        z: ptr,
    ) -> !;
}
unsafe extern "C" {
    pub fn S_boot_error(who: ptr, s: ptr, args: ptr) -> !;
}
unsafe extern "C" {
    pub fn S_handle_docall_error();
}
unsafe extern "C" {
    pub fn S_handle_arg_error();
}
unsafe extern "C" {
    pub fn S_handle_nonprocedure_symbol();
}
unsafe extern "C" {
    pub fn S_handle_values_error();
}
unsafe extern "C" {
    pub fn S_handle_mvlet_error();
}
unsafe extern "C" {
    pub fn S_handle_event_detour();
}
unsafe extern "C" {
    pub fn S_allocate_scheme_signal_queue() -> ptr;
}
unsafe extern "C" {
    pub fn S_dequeue_scheme_signals(tc: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_register_scheme_signal(sig: iptr);
}
unsafe extern "C" {
    pub fn S_fire_collector();
}
unsafe extern "C" {
    pub fn S_noncontinuable_interrupt() -> !;
}
unsafe extern "C" {
    pub fn S_schsig_init();
}
unsafe extern "C" {
    pub fn S_segment_init();
}
unsafe extern "C" {
    pub fn S_getmem(bytes: iptr, zerofill: IBOOL, for_code: IBOOL) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn S_freemem(addr: *mut ::core::ffi::c_void, bytes: iptr, for_code: IBOOL);
}
unsafe extern "C" {
    pub fn S_find_segments(creator: *mut thread_gc, s: ISPC, g: IGEN, n: iptr) -> iptr;
}
unsafe extern "C" {
    pub fn S_free_chunk(chunk: *mut chunkinfo, for_code: IBOOL);
}
unsafe extern "C" {
    pub fn S_free_chunks();
}
unsafe extern "C" {
    pub fn S_curmembytes() -> uptr;
}
unsafe extern "C" {
    pub fn S_maxmembytes() -> uptr;
}
unsafe extern "C" {
    pub fn S_resetmaxmembytes();
}
unsafe extern "C" {
    pub fn S_adjustmembytes(amt: iptr);
}
unsafe extern "C" {
    pub fn S_move_to_chunk_list(chunk: *mut chunkinfo, pchunk_list: *mut *mut chunkinfo);
}
unsafe extern "C" {
    pub fn S_thread_start_code_write(
        tc: ptr,
        maxg: IGEN,
        current: IBOOL,
        hint: *mut ::core::ffi::c_void,
        hint_len: uptr,
    );
}
unsafe extern "C" {
    pub fn S_thread_end_code_write(
        tc: ptr,
        maxg: IGEN,
        current: IBOOL,
        hint: *mut ::core::ffi::c_void,
        hint_len: uptr,
    );
}
unsafe extern "C" {
    pub fn S_stats_init();
}
unsafe extern "C" {
    pub fn S_cputime() -> ptr;
}
unsafe extern "C" {
    pub fn S_realtime() -> ptr;
}
unsafe extern "C" {
    pub fn S_clock_gettime(typeno: I32) -> ptr;
}
unsafe extern "C" {
    pub fn S_gmtime(tzoff: ptr, tspair: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_asctime(dtvec: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_mktime(dtvec: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_unique_id() -> ptr;
}
unsafe extern "C" {
    pub fn S_gettime(typeno: INT, tp: *mut timespec);
}
unsafe extern "C" {
    pub fn S_symbol_value(sym: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_symbol_racy_value(sym: ptr) -> ptr;
}
unsafe extern "C" {
    pub fn S_set_symbol_value(sym: ptr, val: ptr);
}
unsafe extern "C" {
    pub fn S_machine_init();
}
unsafe extern "C" {
    pub fn S_initframe(tc: ptr, n: iptr);
}
unsafe extern "C" {
    pub fn S_put_arg(tc: ptr, i: iptr, x: ptr);
}
unsafe extern "C" {
    pub fn S_return();
}
unsafe extern "C" {
    pub fn S_call_help(tc: ptr, singlep: IBOOL, lock_ts: IBOOL);
}
unsafe extern "C" {
    pub fn S_call_one_result();
}
unsafe extern "C" {
    pub fn S_call_any_results();
}
unsafe extern "C" {
    pub fn S_expeditor_init();
}
unsafe extern "C" {
    pub fn S_random_state_next_integer(s: ptr, n: uptr) -> uptr;
}
unsafe extern "C" {
    pub fn S_random_state_next_double(s: ptr) -> f64;
}
unsafe extern "C" {
    pub fn S_random_state_init(s: ptr, x: UINT);
}
unsafe extern "C" {
    pub fn S_random_state_check(
        x10: f64,
        x11: f64,
        x12: f64,
        x20: f64,
        x21: f64,
        x22: f64,
    ) -> IBOOL;
}
unsafe extern "C" {
    pub fn S_get_process_executable_path(
        execpath: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn scheme_statics();
}
pub type __builtin_va_list = [__va_list_tag; 1usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __va_list_tag {
    pub gp_offset: ::core::ffi::c_uint,
    pub fp_offset: ::core::ffi::c_uint,
    pub overflow_arg_area: *mut ::core::ffi::c_void,
    pub reg_save_area: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __va_list_tag"][::core::mem::size_of::<__va_list_tag>() - 24usize];
    ["Alignment of __va_list_tag"][::core::mem::align_of::<__va_list_tag>() - 8usize];
    ["Offset of field: __va_list_tag::gp_offset"]
        [::core::mem::offset_of!(__va_list_tag, gp_offset) - 0usize];
    ["Offset of field: __va_list_tag::fp_offset"]
        [::core::mem::offset_of!(__va_list_tag, fp_offset) - 4usize];
    ["Offset of field: __va_list_tag::overflow_arg_area"]
        [::core::mem::offset_of!(__va_list_tag, overflow_arg_area) - 8usize];
    ["Offset of field: __va_list_tag::reg_save_area"]
        [::core::mem::offset_of!(__va_list_tag, reg_save_area) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gzFile_s {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lz4File_in_r {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lz4File_out_r {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vfasl_hash_table {
    pub _address: u8,
}
